{
  "title": "Reading Stock Charts Like a Pro",
  "type": "reading",
  "duration": "25 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Reading Stock Charts",
      "subtitle": "Decode price movements and make informed decisions",
      "color": "green",
      "icon": "BarChart"
    },
    {
      "type": "callout",
      "title": "Why Charts Matter",
      "content": "Stock charts are the language of the market. They tell stories about investor sentiment, price trends, and potential future movements. Learning to read them gives you a significant edge over investors who only look at headlines.",
      "color": "blue",
      "icon": "TrendingUp"
    },
    {
      "type": "content",
      "title": "Understanding Price Charts",
      "content": "A stock chart displays the historical price movement of a security over time. The horizontal axis shows time (days, weeks, months, or years), while the vertical axis shows price. The most common chart types are:\n\nLine Charts: Connect closing prices with a continuous line. Simple and clean, great for seeing overall trends at a glance.\n\nBar Charts (OHLC): Show four data points per period - Open, High, Low, and Close. Each bar represents one trading period. The top of the vertical line is the high, the bottom is the low, and small horizontal ticks show open (left) and close (right).\n\nCandlestick Charts: Similar to bar charts but more visual. A filled (red/black) candle means the close was lower than the open (bearish). A hollow (green/white) candle means the close was higher than the open (bullish). The 'wicks' show the high and low."
    },
    {
      "type": "key-points",
      "title": "Essential Chart Elements",
      "points": [
        {
          "title": "Support Levels",
          "description": "Price floors where buying pressure tends to overcome selling pressure. When a stock repeatedly bounces off a certain price, that's support. Think of it as a trampoline - prices tend to bounce up from support."
        },
        {
          "title": "Resistance Levels",
          "description": "Price ceilings where selling pressure tends to overcome buying pressure. When a stock repeatedly fails to break above a certain price, that's resistance. Think of it as a ceiling - prices tend to fall back from resistance."
        },
        {
          "title": "Volume",
          "description": "The number of shares traded during a period. High volume confirms price movements - a breakout on high volume is more significant than one on low volume. Volume bars are typically shown below the price chart."
        },
        {
          "title": "Moving Averages",
          "description": "Lines that smooth out price data by averaging prices over a period (like 50 or 200 days). When price is above the moving average, the trend is generally bullish. When below, it's bearish."
        },
        {
          "title": "Trend Lines",
          "description": "Diagonal lines connecting successive highs (downtrend) or lows (uptrend). They help visualize the direction and strength of a trend. A break of a trend line can signal a reversal."
        }
      ]
    },
    {
      "type": "content",
      "title": "Common Chart Patterns",
      "content": "Chart patterns are formations that appear repeatedly and often predict future price movements:\n\nHead and Shoulders: Three peaks with the middle one highest. Signals a potential reversal from bullish to bearish. The 'neckline' connecting the lows is the key level to watch.\n\nDouble Top/Bottom: Two peaks (top) or troughs (bottom) at roughly the same level. Double tops signal bearish reversals; double bottoms signal bullish reversals.\n\nCup and Handle: A U-shaped recovery followed by a small pullback (the handle). Generally bullish, suggesting the stock will continue higher after the handle completes.\n\nTriangles: Converging trend lines that show consolidation. Ascending triangles (flat top, rising bottom) are bullish. Descending triangles (flat bottom, falling top) are bearish. Symmetrical triangles can break either way.\n\nFlags and Pennants: Short consolidation patterns after a strong move. They typically continue in the direction of the prior trend."
    },
    {
      "type": "steps",
      "title": "How to Analyze a Stock Chart",
      "steps": [
        "Start with the big picture - look at a 5-year or 10-year chart to understand the long-term trend",
        "Identify the current trend - is the stock making higher highs and higher lows (uptrend) or lower highs and lower lows (downtrend)?",
        "Find key support and resistance levels by looking for prices where the stock has repeatedly reversed",
        "Add a 50-day and 200-day moving average to see medium and long-term trends",
        "Check volume - is it increasing on up days and decreasing on down days? That's bullish",
        "Look for chart patterns that might indicate future direction",
        "Zoom into shorter timeframes (daily, hourly) for entry and exit timing"
      ]
    },
    {
      "type": "callout",
      "title": "The Golden Cross & Death Cross",
      "content": "When the 50-day moving average crosses above the 200-day moving average, it's called a 'Golden Cross' - a bullish signal. When the 50-day crosses below the 200-day, it's a 'Death Cross' - a bearish signal. These are widely watched by traders.",
      "color": "green",
      "icon": "TrendingUp"
    },
    {
      "type": "content",
      "title": "Common Mistakes to Avoid",
      "content": "Over-relying on patterns: Chart patterns are probabilities, not certainties. They fail regularly. Always use stop losses and never bet everything on a single pattern.\n\nIgnoring the broader market: Individual stocks are heavily influenced by overall market direction. A bullish pattern in a bear market is less reliable.\n\nAnalysis paralysis: Don't add too many indicators. Price and volume are the most important. Start simple and add complexity only as needed.\n\nConfirmation bias: Don't see patterns that aren't there just because you want a stock to go a certain direction. Be objective.\n\nIgnoring fundamentals: Charts show what has happened, not why. Combine technical analysis with fundamental analysis for better results."
    },
    {
      "type": "callout",
      "title": "Key Takeaway",
      "content": "Stock charts are tools, not crystal balls. They help you understand market sentiment and identify potential opportunities, but they don't guarantee outcomes. Use them as one input in your decision-making process, not the only input.",
      "color": "orange",
      "icon": "Lightbulb"
    },
    {
      "type": "content",
      "title": "Next Steps",
      "content": "Practice reading charts on stocks you're interested in. Most brokerages offer free charting tools. Start by identifying the trend, support/resistance levels, and volume patterns. In the next lesson, we'll dive into fundamental analysis - evaluating a company's financial health and intrinsic value."
    }
  ]
}
