{
  "title": "Fundamental Analysis: Evaluating Company Value",
  "type": "reading",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Fundamental Analysis",
      "subtitle": "Learn to evaluate a company's true worth",
      "color": "green",
      "icon": "Calculator"
    },
    {
      "type": "content",
      "title": "What is Fundamental Analysis?",
      "content": "Fundamental analysis is the process of evaluating a company's intrinsic value by examining its financial statements, competitive position, management quality, and growth prospects. While technical analysis looks at price charts, fundamental analysis asks: 'Is this company actually worth what the market says it's worth?'\n\nThe goal is to find stocks trading below their intrinsic value (undervalued) or avoid stocks trading above their intrinsic value (overvalued). Warren Buffett, one of the most successful investors ever, is famous for his fundamental analysis approach."
    },
    {
      "type": "key-points",
      "title": "Key Financial Statements",
      "points": [
        {
          "title": "Income Statement (Profit & Loss)",
          "description": "Shows revenue, expenses, and profit over a period. Key metrics: Revenue growth, gross margin, operating margin, and net income. Look for consistent growth and expanding margins."
        },
        {
          "title": "Balance Sheet",
          "description": "A snapshot of assets, liabilities, and equity at a point in time. Key metrics: Total debt, cash position, and book value. A strong balance sheet has more assets than liabilities and manageable debt."
        },
        {
          "title": "Cash Flow Statement",
          "description": "Shows actual cash moving in and out. Key metrics: Operating cash flow, free cash flow, and capital expenditures. Profitable companies can still fail if they run out of cash."
        },
        {
          "title": "Earnings Reports",
          "description": "Quarterly updates on financial performance. Compare actual results to analyst estimates. Consistent 'beats' suggest strong execution; consistent 'misses' are red flags."
        }
      ]
    },
    {
      "type": "content",
      "title": "Essential Valuation Ratios",
      "content": "Price-to-Earnings (P/E) Ratio: Stock price divided by earnings per share. A P/E of 20 means you're paying $20 for every $1 of earnings. Lower P/E suggests cheaper valuation, but growth companies often have higher P/Es. Compare to industry peers and historical averages.\n\nPrice-to-Sales (P/S) Ratio: Market cap divided by annual revenue. Useful for companies without profits yet. A P/S under 2 is generally considered reasonable for most industries.\n\nPrice-to-Book (P/B) Ratio: Stock price divided by book value per share. A P/B under 1 means the stock trades below the company's net asset value - potentially undervalued, or the market sees problems.\n\nPEG Ratio: P/E divided by earnings growth rate. A PEG of 1 suggests fair value relative to growth. Under 1 may be undervalued; over 2 may be overvalued.\n\nDebt-to-Equity: Total debt divided by shareholder equity. Higher ratios mean more leverage and risk. Compare to industry norms - some industries (utilities, banks) naturally carry more debt."
    },
    {
      "type": "callout",
      "title": "The Buffett Approach",
      "content": "Warren Buffett looks for companies with: (1) Consistent earnings power, (2) Good return on equity without too much debt, (3) Strong management, (4) Simple, understandable businesses, and (5) Prices below intrinsic value. He famously said: 'It's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.'",
      "color": "green",
      "icon": "TrendingUp"
    },
    {
      "type": "content",
      "title": "Qualitative Factors",
      "content": "Numbers don't tell the whole story. Consider these qualitative factors:\n\nCompetitive Advantage (Moat): Does the company have something that protects it from competition? This could be brand power (Apple, Coca-Cola), network effects (Facebook, Visa), switching costs (Microsoft), or cost advantages (Walmart, Costco).\n\nManagement Quality: Is leadership experienced and trustworthy? Do they own significant stock? Have they delivered on past promises? Check executive compensation - is it aligned with shareholder interests?\n\nIndustry Trends: Is the industry growing or declining? What are the tailwinds and headwinds? A great company in a dying industry faces challenges.\n\nRegulatory Environment: Are there regulatory risks? Healthcare, finance, and tech face significant regulatory scrutiny that can impact profitability."
    },
    {
      "type": "steps",
      "title": "How to Analyze a Stock Fundamentally",
      "steps": [
        "Start with the business - understand what the company does and how it makes money",
        "Read the latest annual report (10-K) and quarterly reports (10-Q) from the SEC website",
        "Calculate key ratios: P/E, P/S, P/B, debt-to-equity, and return on equity",
        "Compare ratios to industry peers and the company's own historical averages",
        "Analyze revenue and earnings trends over 5-10 years - look for consistency",
        "Check free cash flow - is the company generating real cash, not just accounting profits?",
        "Assess the competitive landscape and the company's moat",
        "Research management - their track record, compensation, and insider ownership",
        "Estimate intrinsic value using methods like discounted cash flow (DCF)",
        "Compare your intrinsic value estimate to the current stock price"
      ]
    },
    {
      "type": "content",
      "title": "Red Flags to Watch For",
      "content": "Declining Revenue: Unless there's a clear turnaround plan, shrinking sales are concerning.\n\nInconsistent Earnings: Wild swings in profitability suggest an unpredictable business.\n\nHigh Debt with Rising Interest Rates: Companies with lots of debt suffer when rates rise.\n\nNegative Free Cash Flow: If a company consistently burns cash, it may need to raise money by diluting shareholders.\n\nFrequent Accounting Changes: Changing accounting methods can hide problems.\n\nExecutive Departures: When CFOs or other key executives leave suddenly, investigate why.\n\nRelated Party Transactions: Deals with insiders can be signs of self-dealing.\n\nAuditor Changes: Switching auditors, especially to smaller firms, can be a red flag."
    },
    {
      "type": "callout",
      "title": "Key Takeaway",
      "content": "Fundamental analysis takes time and effort, but it helps you understand what you own. You don't need to analyze every stock - focus on a few companies you understand well. Quality over quantity. And remember: even great companies can be bad investments if you pay too much.",
      "color": "blue",
      "icon": "Lightbulb"
    },
    {
      "type": "content",
      "title": "Next Steps",
      "content": "Pick a company you're interested in and practice fundamental analysis. Pull up their investor relations page, read the latest annual report, and calculate the key ratios. In the next lesson, we'll put everything together and learn how to build a diversified stock portfolio."
    }
  ]
}
