{
  "title": "Building Your Stock Portfolio",
  "type": "reading",
  "duration": "25 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Building a Stock Portfolio",
      "subtitle": "Create a diversified portfolio that matches your goals",
      "color": "green",
      "icon": "PieChart"
    },
    {
      "type": "content",
      "title": "Portfolio Construction Basics",
      "content": "A portfolio is simply a collection of investments. Building a good portfolio isn't about picking the hottest stocks - it's about creating a mix of investments that work together to achieve your goals while managing risk.\n\nThe key principle is diversification: don't put all your eggs in one basket. By spreading investments across different stocks, sectors, and asset classes, you reduce the impact of any single investment going wrong. A well-diversified portfolio can weather market storms better than a concentrated one."
    },
    {
      "type": "key-points",
      "title": "Core Portfolio Principles",
      "points": [
        {
          "title": "Asset Allocation",
          "description": "The split between stocks, bonds, and other assets. This is the biggest driver of returns and risk. A common rule: subtract your age from 110 to get your stock percentage. A 30-year-old might have 80% stocks, 20% bonds."
        },
        {
          "title": "Diversification",
          "description": "Spread investments across sectors (tech, healthcare, finance), company sizes (large, mid, small cap), and geographies (US, international, emerging markets). Aim for 20-30 individual stocks minimum, or use index funds for instant diversification."
        },
        {
          "title": "Risk Tolerance",
          "description": "How much volatility can you stomach? If a 30% drop would make you panic sell, you need a more conservative allocation. Be honest with yourself - your risk tolerance during a bull market is different than during a crash."
        },
        {
          "title": "Time Horizon",
          "description": "Money needed in 1-3 years shouldn't be in stocks. For 5+ year goals, stocks historically outperform. The longer your horizon, the more risk you can take because you have time to recover from downturns."
        },
        {
          "title": "Rebalancing",
          "description": "Over time, winners grow and losers shrink, throwing off your target allocation. Rebalance annually by selling some winners and buying more of underperformers to maintain your target mix."
        }
      ]
    },
    {
      "type": "content",
      "title": "Portfolio Strategies",
      "content": "Core-Satellite Approach: Put 70-80% in broad index funds (the 'core') for diversification and low costs. Use 20-30% for individual stocks or sector bets (the 'satellites') where you have conviction.\n\nDividend Growth Strategy: Focus on companies with long histories of increasing dividends. These tend to be stable, profitable businesses. Reinvest dividends to compound returns.\n\nValue Investing: Buy stocks trading below intrinsic value. Requires patience - value stocks can stay cheap for years before the market recognizes their worth.\n\nGrowth Investing: Focus on companies with high revenue and earnings growth. Accept higher valuations for faster growth. More volatile but potentially higher returns.\n\nIndex Investing: Simply buy the whole market through index funds. No stock picking required. Historically beats most active managers over long periods."
    },
    {
      "type": "callout",
      "title": "The Power of Index Funds",
      "content": "Over 15-year periods, about 90% of actively managed funds underperform their benchmark index. For most investors, a simple portfolio of 2-3 index funds (US stocks, international stocks, bonds) will outperform complex strategies. Keep it simple.",
      "color": "blue",
      "icon": "TrendingUp"
    },
    {
      "type": "steps",
      "title": "Building Your First Portfolio",
      "steps": [
        "Define your goals and time horizon - retirement in 30 years? House down payment in 5 years?",
        "Assess your risk tolerance honestly - how would you react to a 40% drop?",
        "Choose your asset allocation based on goals, timeline, and risk tolerance",
        "Decide between index funds, individual stocks, or a combination",
        "If picking stocks, diversify across at least 5-7 sectors",
        "Start with your largest positions in your highest-conviction ideas",
        "Set up automatic investments to build positions over time (dollar-cost averaging)",
        "Review and rebalance quarterly or annually",
        "Keep some cash (5-10%) for opportunities during market dips"
      ]
    },
    {
      "type": "content",
      "title": "Sample Portfolio Allocations",
      "content": "Aggressive (Young investor, 30+ year horizon):\n- 60% US Stock Index Fund\n- 25% International Stock Index Fund\n- 10% Small Cap/Growth Stocks\n- 5% Bonds\n\nModerate (Mid-career, 15-20 year horizon):\n- 45% US Stock Index Fund\n- 20% International Stock Index Fund\n- 10% Individual Stocks\n- 20% Bond Index Fund\n- 5% REITs\n\nConservative (Near retirement, 5-10 year horizon):\n- 30% US Stock Index Fund\n- 10% International Stock Index Fund\n- 10% Dividend Stocks\n- 40% Bond Index Fund\n- 10% Cash/Money Market\n\nThese are starting points - adjust based on your specific situation."
    },
    {
      "type": "content",
      "title": "Common Portfolio Mistakes",
      "content": "Over-concentration: Putting too much in one stock, even if you love the company. No single position should exceed 5-10% of your portfolio.\n\nHome country bias: US investors often put 100% in US stocks. International diversification reduces risk and captures growth elsewhere.\n\nChasing performance: Buying last year's winners often means buying high. Past performance doesn't predict future results.\n\nOver-trading: Frequent buying and selling racks up costs and taxes. Most investors do better with a buy-and-hold approach.\n\nIgnoring costs: High expense ratios and trading fees compound against you. Choose low-cost index funds when possible.\n\nEmotional decisions: Panic selling during crashes and euphoric buying during bubbles destroys returns. Stick to your plan."
    },
    {
      "type": "callout",
      "title": "Key Takeaway",
      "content": "The best portfolio is one you can stick with through good times and bad. It doesn't need to be perfect or complex. A simple, diversified portfolio that you maintain consistently will outperform a 'perfect' portfolio you abandon during the first downturn.",
      "color": "green",
      "icon": "CheckCircle"
    },
    {
      "type": "content",
      "title": "Next Steps",
      "content": "You now have the foundation to start building your stock portfolio. Open a brokerage account if you haven't already, decide on your allocation, and start investing. Remember: time in the market beats timing the market. The best time to start was yesterday; the second best time is today."
    }
  ]
}
