{
  "title": "Investment Performance Analysis",
  "type": "exercise",
  "duration": "35 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Measure What Matters",
      "subtitle": "Evaluate portfolio performance using professional-grade metrics"
    },
    {
      "type": "overview",
      "title": "You'll Practice",
      "items": [
        "Calculate absolute and risk-adjusted returns",
        "Assess diversification and drawdown behavior",
        "Benchmark against relevant indices",
        "Document insights in an ongoing performance journal"
      ]
    },
    {
      "type": "content",
      "title": "Performance Analysis Basics",
      "content": "Performance measurement is more than checking account balances. You need to know how much of the return came from market exposure versus active decisions, and whether the risk taken was justified."
    },
    {
      "type": "keypoints",
      "title": "Critical Metrics",
      "points": [
        {
          "title": "CAGR",
          "description": "Compound annual growth rate shows the smoothed yearly return over a period." 
        },
        {
          "title": "Volatility",
          "description": "Standard deviation reveals how widely returns fluctuate." 
        },
        {
          "title": "Sharpe Ratio",
          "description": "Measures return per unit of risk, using the risk-free rate as baseline." 
        },
        {
          "title": "Max Drawdown",
          "description": "Largest peak-to-trough drop highlights worst-case scenarios." 
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Benchmark Wisely",
      "content": "Compare your portfolio to an index with similar allocation, not just the S&P 500 by default.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Qualitative Review",
      "content": "Numbers tell part of the story. Note whether decisions aligned with your investment policy, if emotional reactions influenced trades, and what lessons you want to carry forward."
    },
    {
      "type": "actionsteps",
      "title": "Performance Journal",
      "steps": [
        "Gather at least three years of portfolio balance history (if available) or begin tracking monthly going forward.",
        "Compute CAGR, volatility, and Sharpe ratio using spreadsheet formulas or portfolio analysis tools.",
        "Identify the most appropriate benchmark and compare performance over matching periods.",
        "Analyze drawdowns to understand how the portfolio behaves in market stress.",
        "Write a quarterly summary noting key drivers of performance, mistakes made, and adjustments planned."
      ]
    },
    {
      "type": "protip",
      "title": "Automate Data Pulls",
      "content": "Use APIs or portfolio trackers that export performance metrics to save time and ensure accuracy.",
      "icon": "database"
    }
  ]
}
