{
  "title": "Portfolio Diversification Strategies",
  "type": "reading",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Protect Growth with Smart Diversification",
      "subtitle": "Design a portfolio that captures upside while managing downside risk"
    },
    {
      "type": "overview",
      "title": "Learning Goals",
      "items": [
        "Understand the purpose of diversification",
        "Compare strategic vs. tactical diversification approaches",
        "Explore diversification across asset classes, sectors, and geographies",
        "Identify common mistakes that reduce diversification benefits"
      ]
    },
    {
      "type": "content",
      "title": "Why Diversify?",
      "content": "Diversification reduces the impact of any single asset's performance on your total portfolio. By owning securities that do not move in perfect lockstep, you smooth returns over time and avoid catastrophic losses tied to one company, sector, or region."
    },
    {
      "type": "keypoints",
      "title": "Dimensions of Diversification",
      "points": [
        {
          "title": "Asset Classes",
          "description": "Mix equities, fixed income, real assets, and cash equivalents to balance growth and stability."
        },
        {
          "title": "Sectors & Industries",
          "description": "Ensure exposure across technology, healthcare, consumer, industrial, and other sectors to avoid concentration risk." 
        },
        {
          "title": "Geography",
          "description": "Blend domestic and international markets to capture global growth and currency diversification."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Correlation Matters",
      "content": "True diversification comes from combining assets with low or negative correlation, not just owning many holdings.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Strategic vs. Tactical Diversification",
      "content": "Strategic diversification sets a long-term allocation aligned with risk tolerance and time horizon, reviewed annually. Tactical adjustments seek short-term advantages by overweighting or underweighting allocations based on market views. Most individual investors benefit from a primarily strategic approach with limited tactical tilts."
    },
    {
      "type": "content",
      "title": "Common Pitfalls",
      "content": "Owning multiple funds that track the same index, overweighting employer stock, or ignoring bond duration can undo diversification. Regularly audit your holdings to confirm unique exposure."
    },
    {
      "type": "actionsteps",
      "title": "Diversification Audit",
      "steps": [
        "List every holding in your portfolio and assign it to an asset class and sector.",
        "Calculate the percentage of your total portfolio each holding represents.",
        "Identify any position exceeding 10% of your portfolio and note if it needs trimming.",
        "Review the overlap between mutual funds or ETFs by checking their top holdings.",
        "Document one change you will make to improve diversification this quarter."
      ]
    },
    {
      "type": "protip",
      "title": "Use Core-Satellite",
      "content": "Keep low-cost index funds as your diversified core and add smaller satellite positions for targeted themes.",
      "icon": "layers"
    }
  ]
}
