{
  "title": "Choosing the Right Bank Account",
  "type": "reading",
  "duration": "21 min",
  "points": 130,
  "sections": [
    {
      "type": "hero",
      "title": "Match Your Money to the Best Home",
      "subtitle": "Evaluate checking and savings options so fees stay low and features elevate your cash flow"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How different account types support spending, saving, and long-term goals",
        "Which fee structures and requirements to watch for before opening an account",
        "Feature checklists for digital-first banks vs. credit unions and community banks",
        "A decision matrix you can reuse whenever your banking needs change"
      ]
    },
    {
      "type": "content",
      "title": "Banking as Infrastructure",
      "content": "The right bank account removes friction from daily money management. Checking handles transactions, savings protects short-term goals, and specialized accounts (cash management, HSAs, business accounts) add targeted utility. Instead of defaulting to the bank closest to home, analyze how you use money today and which tools will support tomorrow's goals."
    },
    {
      "type": "keypoints",
      "title": "Account Selection Criteria",
      "points": [
        {
          "title": "Monthly Fees & Minimums",
          "description": "Aim for zero or easily waived fees. Know the balance or activity required to keep the account free."
        },
        {
          "title": "Access & Convenience",
          "description": "Consider ATM networks, branch proximity, mobile deposit limits, and customer support hours."
        },
        {
          "title": "Technology Stack",
          "description": "Budgeting integrations, bill pay, push notifications, and virtual cards can automate better habits."
        },
        {
          "title": "Safety & Insurance",
          "description": "FDIC/NCUA coverage up to $250,000 per depositor per ownership category protects deposits."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "One Size? No Thanks",
      "content": "Most people benefit from using two institutions: a primary checking account for bills and an online high-yield savings account for goals.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Big Bank vs. Digital Bank vs. Credit Union",
      "content": "Big banks offer vast ATM networks and in-person service but often low savings rates. Digital banks deliver strong yields and lower fees, yet cash deposits can be tricky. Credit unions provide community focus and competitive loan rates. Compare each against your priorities—there is no universal best, only the best fit."
    },
    {
      "type": "content",
      "title": "Decision Matrix Walkthrough",
      "content": "Create a 1-5 scoring matrix covering fees, yields, features, access, and customer reviews. Weight categories based on your lifestyle (e.g., frequent travelers prioritize ATM access). Score three candidate institutions, tally totals, and document why your chosen bank wins. Repeat annually or whenever your needs evolve."
    },
    {
      "type": "actionsteps",
      "title": "Account Selection Sprint",
      "steps": [
        "List the accounts you currently hold, including balances and fees",
        "Identify pain points (e.g., low yield, high fees, clunky app)",
        "Pick three new institutions to evaluate using the lesson matrix",
        "Score each institution and choose a primary + secondary option",
        "Schedule account opening and fund transfers, then set a 6-month review reminder"
      ]
    },
    {
      "type": "protip",
      "title": "Use Ally/SoFi/Local Combo",
      "content": "Pair a feature-rich online bank with a nearby credit union. You get digital automation plus an in-person fallback when you need cashier’s checks or immediate assistance.",
      "icon": "lightbulb"
    }
  ]
}
