{
  "title": "Understanding Bank Fees",
  "type": "exercise",
  "duration": "28 min",
  "points": 160,
  "sections": [
    {
      "type": "hero",
      "title": "Stop Paying Sneaky Bank Fees",
      "subtitle": "Audit your accounts, eliminate hidden charges, and negotiate smarter terms"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Analyze current statements to catalog every fee you’ve paid in the past 12 months",
        "Identify which fees are avoidable, negotiable, or signs you should leave the institution",
        "Engineer a fee-free account structure that still offers the features you need",
        "Draft a negotiation script and escalation plan to recover past fees"
      ]
    },
    {
      "type": "content",
      "title": "Fee Types to Watch",
      "content": "Banks monetize accounts through monthly maintenance charges, overdraft fees, out-of-network ATM fees, minimum balance penalties, paper statement fees, and foreign transaction charges. Some are easy to avoid with alerts and automation; others require switching accounts or institutions. Awareness is the first defense."
    },
    {
      "type": "content",
      "title": "Fee Triggers",
      "content": "Most fees activate when you fall below minimum balances, miss automatic deposits, or use services outside your plan. Audit how you use your account—if you frequently need wire transfers or international ATM access, choose an account designed for that behavior to avoid piecemeal charges."
    },
    {
      "type": "keypoints",
      "title": "Elimination Playbook",
      "points": [
        {
          "title": "Automate Requirements",
          "description": "Set up recurring transfers or direct deposits to meet balance/transaction thresholds automatically."
        },
        {
          "title": "Use Fee-Free ATM Networks",
          "description": "Leverage partner networks or reimbursements from online banks to avoid $3–$6 per withdrawal costs."
        },
        {
          "title": "Opt Into Alerts",
          "description": "Low-balance and large-transaction alerts give you time to move funds before a fee hits."
        },
        {
          "title": "Negotiate & Escalate",
          "description": "Banks often refund fees for loyal customers—call, reference your history, and escalate to a supervisor if needed."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Activation Energy",
      "content": "Documenting fees for 30 minutes can recapture hundreds of dollars per year—money you can redirect to savings goals.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Fee Audit Sprint",
      "steps": [
        "Download 12 months of statements for each bank account",
        "Highlight every fee and log it in the provided worksheet (date, amount, reason)",
        "Categorize fees as avoidable, negotiable, or structural (requires switching)",
        "Call customer service with a negotiation script to request refunds for avoidable charges",
        "Set up alerts/automations or initiate an account switch to prevent repeat fees"
      ]
    },
    {
      "type": "content",
      "title": "When to Switch",
      "content": "If fees persist despite optimizations, use your decision matrix from `banking_1` to evaluate new institutions. Many online banks reimburse ATM fees worldwide, offer no foreign transaction fees, and provide stronger tech without minimum balance requirements."
    },
    {
      "type": "protip",
      "title": "Record Calls",
      "content": "Ask the bank to note your account with negotiated perks (fee waivers, overdraft forgiveness). Request email confirmation so the benefit sticks even if representatives change.",
      "icon": "lightbulb"
    }
  ]
}
