{
  "title": "Tracking Variable Expenses",
  "type": "reading",
  "duration": "20 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Master the Moving Targets",
      "subtitle": "Build a system for keeping tabs on every fluctuating dollar"
    },
    {
      "type": "overview",
      "title": "Lesson Roadmap",
      "items": [
        "Understand why variable expenses derail budgets",
        "Categorize predictable vs. unpredictable costs",
        "Adopt tracking tools that fit your lifestyle",
        "Translate tracking data into actionable decisions"
      ]
    },
    {
      "type": "content",
      "title": "Why Variable Costs Matter",
      "content": "During months when dining out, utilities, or transportation spike, your plan can fall apart if you only account for fixed bills. Tracking keeps you proactive instead of reactive, reducing surprises and guilt."
    },
    {
      "type": "keypoints",
      "title": "Tracking Principles",
      "points": [
        {
          "title": "Categorize Clearly",
          "description": "Group similar expenses (food, mobility, lifestyle) to spot trends fast."
        },
        {
          "title": "Capture Quickly",
          "description": "Record spending within 24 hours to preserve context and prevent forgetfulness."
        },
        {
          "title": "Review Weekly",
          "description": "Look back every week, while details are fresh, to adjust the upcoming days."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Data Turns to Insight",
      "content": "Numbers show patterns. Once you see the pattern, you can change the outcome.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Tools That Work",
      "content": "Choose a method you will actually use: budgeting apps (YNAB, Monarch) for automation, spreadsheets for customization, or notebook/bullet journal for tactile tracking. The tool matters less than the habit of logging and reviewing."
    },
    {
      "type": "actionsteps",
      "title": "Create Your Tracking Workflow",
      "steps": [
        "List the top five variable categories that cause monthly swings.",
        "Select a tracking tool and set it up with matching categories.",
        "Enable real-time transaction alerts or schedule a daily 5-minute logging session.",
        "At the end of each week, compare your actual spend to your planned cap and note adjustments."
      ]
    },
    {
      "type": "protip",
      "title": "Tag the Story",
      "content": "Add short notes like 'celebration dinner' or 'busy week takeout'—context helps you make smarter choices later.",
      "icon": "tag"
    }
  ]
}
