{
  "title": "Budgeting for Life Changes",
  "type": "exercise",
  "duration": "30 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Stay Agile Through Transitions",
      "subtitle": "Adapt your budget for milestones like moving, career shifts, or growing family needs"
    },
    {
      "type": "overview",
      "title": "In This Session",
      "items": [
        "Forecast the financial impact of major life events",
        "Identify temporary vs. permanent expense changes",
        "Build contingency buffers and timelines",
        "Communicate changes with stakeholders (partners, family)"
      ]
    },
    {
      "type": "content",
      "title": "Change Requires a New Baseline",
      "content": "Big life moments—new jobs, relocations, caregiving—demand a fresh look at cash flow. Anticipating costs early prevents panic and keeps you anchored to long-term goals."
    },
    {
      "type": "keypoints",
      "title": "Planning Framework",
      "points": [
        {
          "title": "Timeline Mapping",
          "description": "Lay out key dates (start/finish) to align expenses and income changes."
        },
        {
          "title": "Scenario Analysis",
          "description": "Draft best, likely, and worst-case budgets so you're ready for curveballs."
        },
        {
          "title": "Communication",
          "description": "Share updates with partners or accountability buddies to stay coordinated."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Emergency + Cushion",
      "content": "Pair your standard emergency fund with a transition buffer equal to one month's projected new expenses.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Cash Flow Shock Absorbers",
      "content": "Pause nonessential sinking funds, renegotiate recurring bills, or pick up interim income streams while you adjust. Remember that some expenses are one-time setup costs (moving fees) while others alter your monthly baseline (childcare)."
    },
    {
      "type": "actionsteps",
      "title": "Transition Blueprint",
      "steps": [
        "Name the upcoming life change and list associated expenses (one-time and ongoing).",
        "Estimate income shifts during the transition period and note any gaps.",
        "Create three budget scenarios (optimistic, realistic, stretch) and note triggers for switching between them.",
        "Decide which discretionary categories to scale back temporarily and for how long.",
        "Schedule a midpoint review (date) to measure progress and adjust the plan."
      ]
    },
    {
      "type": "protip",
      "title": "Document Lessons",
      "content": "After the transition, record what worked and what surprised you—future you will thank you during the next change.",
      "icon": "clipboard"
    }
  ]
}
