{
  "title": "Reading Your Credit Report",
  "type": "exercise",
  "duration": "25 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Read and Decode Your Credit Report",
      "subtitle": "Step-by-step walkthrough to spot errors and opportunities",
      "image": "/images/lessons/credit-report-review.jpg"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Download a fresh copy of your credit report for free",
        "Identify the key sections and what each one means",
        "Spot red flags like late payments, collections, or high balances",
        "Document disputes or updates you need to submit"
      ]
    },
    {
      "type": "content",
      "title": "Get Your Reports Without Paying",
      "content": "Federal law entitles you to a free credit report from each of the three major bureaus every 12 months. Visit AnnualCreditReport.com — the only federally authorized site — and pull Experian, Equifax, and TransUnion. During promotional periods you may be able to download all three at once; otherwise, stagger requests every few months to monitor year-round."
    },
    {
      "type": "content",
      "title": "Know the Layout",
      "content": "Each report follows a similar structure: personal information, credit accounts (tradelines), credit inquiries, public records, and collections. Scan for outdated addresses or misspelled names in the personal section — they can signal mixed files. In the tradelines section, focus on the payment history grid, current balance, credit limit, and account status."
    },
    {
      "type": "highlight",
      "title": "Accuracy Is Required",
      "content": "Under the Fair Credit Reporting Act, bureaus must report information that is complete, accurate, and verifiable. If something looks wrong, you have the right to dispute it for free.",
      "color": "green"
    },
    {
      "type": "actionsteps",
      "title": "Hands-On Review Checklist",
      "steps": [
        "Download your most recent reports and save them securely with the download date in the filename.",
        "Highlight any late payments, charge-offs, or collections. Note the creditor, date, and amount.",
        "Calculate utilization for each revolving account: balance ÷ credit limit × 100.",
        "Create a two-column list. Left column: items to dispute or correct. Right column: supporting documents (statements, emails, payoff letters).",
        "Draft a sample dispute letter or use the bureau's online dispute form for the highest-priority error."
      ]
    },
    {
      "type": "content",
      "title": "When to Dispute",
      "content": "Dispute information that is incorrect, incomplete, or belongs to someone else. Provide copies (never originals) of documentation and mail disputes via certified mail with return receipt requested. Bureaus usually respond within 30 days. For legitimate negative items, add a consumer statement to explain special circumstances and focus on rebuilding habits."
    },
    {
      "type": "protip",
      "title": "Pro Tip",
      "content": "If you are preparing for a major loan, finish disputes at least 60 days before applying. Updated reports take time to propagate across lender systems.",
      "icon": "lightbulb"
    }
  ]
}
