{
  "title": "Credit Card Best Practices",
  "type": "reading",
  "duration": "18 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Credit Card Best Practices",
      "subtitle": "Use revolving credit to build wealth, not worry",
      "image": "/images/lessons/credit-card-best-practices.jpg"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to pick cards that match your spending profile",
        "Habits that keep utilization low and rewards high",
        "Ways to automate payments and avoid interest",
        "Signals that it's time to upgrade or downgrade a card"
      ]
    },
    {
      "type": "content",
      "title": "Choose Cards with Intention",
      "content": "Start with a cash-back or flat-rate rewards card that has no annual fee. Pair it with a card that offers bonus categories on expenses you already have (groceries, gas, streaming). Look for welcome bonuses that align with planned purchases, not aspirational spending."
    },
    {
      "type": "highlight",
      "title": "Keep Utilization in Check",
      "content": "Utilization — the balance-to-limit ratio — should ideally stay below 30%, and under 10% if you are chasing top-tier scores. Request periodic credit limit increases and pay balances before the statement closing date to report lower amounts.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Paying Strategically",
      "content": "Set autopay for at least the statement balance to avoid interest. If cash flow allows, pay the current balance twice per month — once right after payday and once before the due date. This keeps utilization low and prevents interest from accruing."
    },
    {
      "type": "keypoints",
      "title": "Smart Rewards Strategy",
      "points": [
        {
          "title": "Align with Goals",
          "description": "Travel hackers focus on transferable points, while cash-back enthusiasts optimize for statement credits."
        },
        {
          "title": "Track Yearly Fees",
          "description": "Use a spreadsheet or app to review whether card perks (credits, lounge access) outweigh annual fees."
        },
        {
          "title": "Avoid Balance Transfers Traps",
          "description": "Promotional 0% APR offers can help if you budget payoffs meticulously; otherwise, deferred interest can erase savings."
        }
      ]
    },
    {
      "type": "content",
      "title": "Upgrade, Downgrade, or Cancel?",
      "content": "If a card no longer earns its keep, call the issuer to product-change it to a no-fee option. This preserves account age and credit limit. Only cancel as a last resort, and never close your oldest card unless it charges an unavoidable fee."
    },
    {
      "type": "protip",
      "title": "Pro Tip",
      "content": "Set calendar reminders for quarterly credits and annual bonuses so you actually redeem the perks you're paying for.",
      "icon": "lightbulb"
    }
  ]
}
