{
  "title": "Debt Payoff Strategies",
  "type": "exercise",
  "duration": "22 min",
  "points": 175,
  "sections": [
    {
      "type": "hero",
      "title": "Design Your Debt Payoff Plan",
      "subtitle": "Compare snowball, avalanche, and hybrid strategies to pick your path",
      "image": "/images/lessons/debt-payoff-plan.jpg"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "List every debt with balance, APR, and minimum payment",
        "Calculate timelines using snowball and avalanche methods",
        "Evaluate trade-offs between motivation and math",
        "Build a payoff tracker you can update monthly"
      ]
    },
    {
      "type": "content",
      "title": "Snowball vs. Avalanche",
      "content": "The snowball method targets the smallest balances first, creating psychological wins. The avalanche method targets the highest APR first, saving money on interest. Both work if you stay consistent; choose the one that keeps you motivated to stick with the plan."
    },
    {
      "type": "highlight",
      "title": "Hybrid Strategy",
      "content": "Start with one or two quick snowball wins, then switch to avalanche to maximize interest savings. This approach blends momentum with mathematical efficiency.",
      "color": "blue"
    },
    {
      "type": "content",
      "title": "Gather Your Numbers",
      "content": "Create a table with columns for lender name, balance, APR, minimum payment, due date, and notes. Include any promo rates and when they expire. Total up your minimum payments and decide how much extra you can put toward the focus debt each month."
    },
    {
      "type": "actionsteps",
      "title": "Build Your Payoff Tracker",
      "steps": [
        "List debts from smallest balance to largest in one column and from highest APR to lowest in another. This gives you the snowball and avalanche orders side by side.",
        "For each debt, calculate months to pay off using both strategies. Use an online calculator or spreadsheet: Payment = minimum + extra (focused on one debt at a time).",
        "Pick the strategy that gets you debt-free fastest while keeping you motivated. Circle it and note your target debt-free date.",
        "Create a monthly progress log. Each month record starting balance, payment made, and ending balance for your focus debt.",
        "Set calendar reminders for payment due dates and a monthly review session to celebrate progress and reallocate extra funds."
      ]
    },
    {
      "type": "content",
      "title": "Staying on Track",
      "content": "Automate minimum payments to avoid late fees, then schedule your extra payment right after payday. When a debt is paid off, roll that full payment amount to the next debt in line. Keep an emergency fund so unexpected expenses don't force you to pause the plan."
    },
    {
      "type": "protip",
      "title": "Pro Tip",
      "content": "Call lenders to request a lower APR once you've made 6-12 on-time payments. Even a 1-2% reduction can shave months off your payoff timeline.",
      "icon": "lightbulb"
    }
  ]
}
