{
  "title": "Understanding Credit Scores",
  "type": "reading",
  "duration": "20 min",
  "points": 125,
  "sections": [
    {
      "type": "hero",
      "title": "Understanding Credit Scores",
      "subtitle": "Decode what makes up your score and how to improve it",
      "image": "/images/lessons/credit-score-dashboard.jpg"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "What a credit score measures and the models lenders use",
        "How payment history, utilization, length of credit, and mix influence your score",
        "Ways to monitor your credit health without hurting your score",
        "Simple actions you can take this week to raise your score"
      ]
    },
    {
      "type": "content",
      "title": "Credit Scores 101",
      "content": "A credit score is a three-digit number that signals your likelihood of paying bills on time. Lenders, landlords, and even some employers rely on this number to make decisions. The most common scoring models are FICO and VantageScore, both ranging from 300 to 850. Higher scores unlock lower interest rates, better loan terms, and increased negotiating power."
    },
    {
      "type": "highlight",
      "title": "Why It Matters",
      "content": "A one-point increase in your score can mean thousands of dollars saved across the life of a loan. Even small improvements in how you manage credit can compound into major financial wins.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "What Builds — and Hurts — Your Score",
      "content": "Payment history (35% of a FICO score) is the most important factor. Missing just one payment can drop your score significantly and stay on your report for up to seven years. Utilization (30%) measures how much credit you are using relative to your limits — aim to keep it below 30%, and under 10% for the best results. The length of your credit history (15%) rewards keeping older accounts open. The remaining 20% comes from credit mix and new credit inquiries. Opening multiple new accounts at once can temporarily lower your score."
    },
    {
      "type": "keypoints",
      "title": "Score Ranges at a Glance",
      "points": [
        {
          "title": "Excellent (760-850)",
          "description": "Best available rates and loan terms, ideal for major purchases like mortgages."
        },
        {
          "title": "Good (700-759)",
          "description": "Qualifies for most credit products with competitive interest rates."
        },
        {
          "title": "Needs Work (<650)",
          "description": "May face higher interest rates or security deposits; focus on rebuilding strategies."
        }
      ]
    },
    {
      "type": "content",
      "title": "Monitoring Without Damaging Your Score",
      "content": "Checking your own credit report is a soft inquiry and does NOT impact your score. Use AnnualCreditReport.com to download a free report from each major bureau (Experian, Equifax, TransUnion) every 12 months, or stagger requests every four months to keep tabs year-round. For score tracking, use reputable apps from your bank or credit card issuer that refresh at least monthly."
    },
    {
      "type": "actionsteps",
      "title": "Your Next Steps",
      "steps": [
        "Pull your latest credit reports and review them for errors or outdated information.",
        "Set up automatic payments or calendar reminders to ensure bills are never late.",
        "Calculate your current credit utilization: total balances divided by total limits.",
        "Plan a targeted payoff to bring utilization under 30% within the next two months."
      ]
    },
    {
      "type": "protip",
      "title": "Pro Tip",
      "content": "If an account has a spotless history, keep it open even if you rarely use it. The longer aging and available limit help your score, provided there are no annual fees weighing you down.",
      "icon": "lightbulb"
    }
  ]
}
