{
  "title": "Creating a Business Plan",
  "type": "exercise",
  "duration": "30 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Your Business Roadmap",
      "subtitle": "Developing a comprehensive plan to guide your entrepreneurial journey"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Essential components of a business plan",
        "Market analysis and competitive research",
        "Financial projections and funding requirements",
        "Operational planning and milestone setting"
      ]
    },
    {
      "type": "content",
      "title": "Business Plan Fundamentals",
      "content": "A business plan is a written document that describes your business, its objectives, strategies, target market, and financial forecasts. It serves as a roadmap for your business and is essential for attracting investors, partners, and lenders. Even if you're bootstrapping, a business plan helps clarify your thinking and identify potential challenges."
    },
    {
      "type": "keypoints",
      "title": "Key Business Plan Sections",
      "points": [
        {
          "title": "Executive Summary",
          "description": "A high-level overview of your business concept, unique value proposition, and key success factors."
        },
        {
          "title": "Market Analysis",
          "description": "Research on your target market, customer needs, competition, and industry trends."
        },
        {
          "title": "Financial Projections",
          "description": "Realistic revenue, expense, and cash flow projections for the first 3-5 years."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Business Plans Are Living Documents",
      "content": "Your business plan should evolve as you learn more about your market and customers. Update it regularly based on real-world experience and new information.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Market Research and Analysis",
      "content": "Understand your target customers' demographics, behaviors, needs, and preferences. Analyze competitors to identify market gaps and differentiation opportunities. Use both primary research (surveys, interviews) and secondary research (industry reports, government data) to build a comprehensive market understanding."
    },
    {
      "type": "actionsteps",
      "title": "Develop Your Business Plan",
      "steps": [
        "Write a clear problem statement and your unique solution",
        "Research your target market and competition thoroughly",
        "Create realistic financial projections based on your research",
        "Set specific milestones and metrics to track progress"
      ]
    },
    {
      "type": "protip",
      "title": "Start Lean",
      "content": "Don't try to write a 50-page business plan initially. Start with a one-page business model canvas or lean plan, then expand as needed for specific purposes like seeking funding."
    }
  ]
}
