{
  "title": "Creating a Business Plan",
  "type": "exercise",
  "duration": "30 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Turn Vision Into an Executable Roadmap",
      "subtitle": "Draft a lean business plan that keeps investors, teammates, and customers aligned"
    },
    {
      "type": "overview",
      "title": "What You'll Produce",
      "items": [
        "A concise one-page business plan with mission, market, and metrics",
        "SMART targets for the first 12 months of operation",
        "A cost structure and revenue model summary",
        "A milestone timeline with owners and checkpoints"
      ]
    },
    {
      "type": "content",
      "title": "Keep It Lean but Insightful",
      "content": "Investors scan for clarity. Outline the customer, the problem, your solution, and the unfair advantage you bring. Focus on evidence gathered during validation rather than assumptions."
    },
    {
      "type": "keypoints",
      "title": "Business Plan Pillars",
      "points": [
        {
          "title": "Market Summary",
          "description": "Size, growth rate, and key trends proving the opportunity is worth chasing."
        },
        {
          "title": "Go-to-Market",
          "description": "How you will reach and convert early adopters within budget."
        },
        {
          "title": "Financial Snapshot",
          "description": "Projected revenue, costs, gross margin, and break-even timeline in a simple table."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Update Quarterly",
      "content": "Schedule a 90-day review to refresh assumptions, celebrate wins, and adjust targets before drift sets in.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Plan Sprint Worksheet",
      "steps": [
        "Write a 2-sentence mission statement that names the customer and outcome.",
        "Capture top three customer segments with estimated market size.",
        "List the main revenue streams and the cost to deliver each.",
        "Draft a 12-month milestone timeline including MVP launch, first 50 customers, and break-even point.",
        "Share the plan with a mentor or advisor and log their feedback for iteration."
      ]
    },
    {
      "type": "protip",
      "title": "Visuals Win Trust",
      "content": "Use charts for financials and traction metrics—decision makers digest visuals faster than dense paragraphs.",
      "icon": "bar-chart"
    }
  ]
}
