{
  "title": "Business Idea Validation",
  "type": "exercise",
  "duration": "25 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Prove Your Idea Deserves Liftoff",
      "subtitle": "Stress-test the problem, audience, and solution before you invest serious time or money"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "A crystal-clear problem statement backed by real-world evidence",
        "A target customer profile with pains, needs, and purchasing triggers",
        "A simple validation plan leveraging interviews, forums, and waitlists",
        "An action scorecard that decides pivot, pursue, or pause"
      ]
    },
    {
      "type": "content",
      "title": "Start With the Pain, Not the Product",
      "content": "Great companies solve painful problems. Identify the job customers need done and the workaround they currently tolerate. Document costs (money, time, frustration) so you can quantify why solving it matters."
    },
    {
      "type": "keypoints",
      "title": "Validation Signals",
      "points": [
        {
          "title": "Urgency",
          "description": "Is the problem frequent or expensive enough that customers actively seek solutions?"
        },
        {
          "title": "Budget",
          "description": "Have customers already paid for alternatives? Prior spending indicates willingness to pay."
        },
        {
          "title": "Access",
          "description": "Can you reach customers through communities, ads, or partnerships without unsustainable costs?"
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Quantify Interest Early",
      "content": "A 20% conversion rate from landing page visits to waitlist sign-ups is a solid benchmark for consumer ideas. Iterate until you hit a metric that proves traction.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Validation Sprint",
      "steps": [
        "Write a one-sentence problem statement and share it with three potential customers for feedback.",
        "Host five discovery calls focused on pain points, not pitching your solution.",
        "Draft a simple value proposition and landing page using no-code tools.",
        "Drive targeted traffic (forums, niche communities, small ad spend) and measure sign-up interest.",
        "Score results using a pursue/pause/pivot matrix and document your next move."
      ]
    },
    {
      "type": "protip",
      "title": "Avoid Confirmation Bias",
      "content": "Ask open-ended questions and let interviewees talk. The more they reveal unprompted, the more authentic your insights.",
      "icon": "mic"
    }
  ]
}
