{
  "title": "Legal Structure and Taxes",
  "type": "reading",
  "duration": "18 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Choosing the Right Business Structure",
      "subtitle": "Legal and tax implications of different business entities"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Common business entity types and their characteristics",
        "Tax implications of different structures",
        "Legal liability considerations",
        "How to choose the right structure for your business"
      ]
    },
    {
      "type": "content",
      "title": "Business Entity Options",
      "content": "The right business structure affects your taxes, personal liability, and administrative requirements. Common options include sole proprietorship, partnership, LLC, S-Corporation, and C-Corporation. Each has different implications for taxes, liability protection, and complexity."
    },
    {
      "type": "keypoints",
      "title": "Entity Comparison",
      "points": [
        {
          "title": "Sole Proprietorship",
          "description": "Simplest structure, no legal separation from business, income taxed on personal return."
        },
        {
          "title": "LLC",
          "description": "Flexible structure with liability protection, can choose tax treatment, more paperwork than sole prop."
        },
        {
          "title": "Corporation",
          "description": "Separate legal entity with strong liability protection, double taxation unless S-Corp, more complex."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Liability Protection Matters",
      "content": "Without proper business structure, your personal assets could be at risk if your business faces legal issues. LLCs and corporations provide liability protection.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Tax Considerations",
      "content": "Different structures have different tax implications. S-Corporations avoid double taxation, LLCs offer flexibility in tax treatment, and sole proprietorships have the simplest tax filing. Consider both current and future tax situations when choosing."
    },
    {
      "type": "actionsteps",
      "title": "Choose Your Business Structure",
      "steps": [
        "Assess your liability risks and need for personal asset protection",
        "Consider your current and projected income for tax implications",
        "Research the administrative requirements of each structure",
        "Consult with a lawyer and accountant before making your final decision"
      ]
    },
    {
      "type": "protip",
      "title": "You Can Change Structures",
      "content": "Many businesses start as sole proprietorships or LLCs and convert to corporations as they grow. Choose a structure that fits your current needs but be prepared to change as your business evolves."
    }
  ]
}
