{
  "title": "Legal Structure and Taxes",
  "type": "reading",
  "duration": "18 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Choose the Structure That Protects and Scales",
      "subtitle": "Compare sole proprietorship, LLC, and corporation models with a tax lens"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Pros and cons of common business entities",
        "How taxation shifts between pass-through and corporate structures",
        "Compliance checklist for registrations, licenses, and filings",
        "Key conversations to have with legal and tax advisors"
      ]
    },
    {
      "type": "content",
      "title": "Protection First, Taxes Second",
      "content": "Pick a structure that shields personal assets and supports your funding strategy. LLCs suit most early-stage founders because they offer liability protection with pass-through taxation. When profits grow or investors require preferred stock, evaluate S-Corp election or C-Corp formation."
    },
    {
      "type": "keypoints",
      "title": "Entity Snapshots",
      "points": [
        {
          "title": "Sole Proprietorship",
          "description": "Fast to set up but no liability shield and self-employment tax on all profits."
        },
        {
          "title": "LLC",
          "description": "Flexible ownership, pass-through taxation, and credibility; consider S-Corp election for payroll tax savings."
        },
        {
          "title": "C-Corp",
          "description": "Preferred for venture funding; double taxation mitigated by deductible benefits and qualified small business stock (QSBS)."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Track Deadlines",
      "content": "File annual reports, franchise taxes, and quarterly estimated taxes on time. Missed deadlines risk penalties and losing good standing.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Build Your Advisor Bench",
      "content": "At minimum, consult a small-business attorney and CPA once a year. They catch state-specific obligations, draft operating agreements, and optimize tax elections as revenue grows."
    },
    {
      "type": "actionsteps",
      "title": "Entity Setup Checklist",
      "steps": [
        "Confirm your business name is available and register it with the state.",
        "Apply for an EIN and open a dedicated business bank account.",
        "Draft an operating agreement or bylaws even if not required—clarity prevents future disputes.",
        "Record compliance tasks (sales tax permits, workers' comp, licenses) in your operating calendar.",
        "Schedule quarterly tax reviews to adjust estimated payments based on actual revenue."
      ]
    },
    {
      "type": "protip",
      "title": "Separate Everything",
      "content": "Never mix personal and business finances. Commingling can pierce the liability shield you worked to secure.",
      "icon": "shield"
    }
  ]
}
