{
  "title": "Marketing on a Budget",
  "type": "exercise",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Win Attention Without Burning Cash",
      "subtitle": "Design a scrappy marketing engine that compounds reach through content, community, and referrals"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "Audience persona and channel matrix",
        "Content pillars mapped to each stage of the funnel",
        "Referral and ambassador loop with simple incentives",
        "Key metrics dashboard for weekly optimization"
      ]
    },
    {
      "type": "content",
      "title": "Lead With Value",
      "content": "Organic marketing thrives on consistency and helpfulness. Choose two primary channels where your audience already gathers—newsletters, LinkedIn groups, niche subreddits—and commit to delivering actionable insights every week."
    },
    {
      "type": "keypoints",
      "title": "Low-Budget Plays",
      "points": [
        {
          "title": "Partner Collabs",
          "description": "Swap webinars, guest posts, or newsletter shoutouts with complementary brands."
        },
        {
          "title": "User-Generated Content",
          "description": "Feature customer wins and tutorials to build trust while multiplying your reach."
        },
        {
          "title": "Lifecycle Email",
          "description": "Automate onboarding, activation, and re-engagement emails to nurture leads without extra spend."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Measure CAC Weekly",
      "content": "Track cost per acquired customer (CAC). If CAC creeps above your payback target, pause campaigns and reallocate to higher performing channels.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Budget Marketing Sprint",
      "steps": [
        "Define your audience's top three pain points and phrases they use to describe them.",
        "Choose two core channels and schedule 30 days of content across each.",
        "Create a simple lead magnet (checklist, template, mini-course) and connect it to your email list.",
        "Implement a referral reward (discount, exclusive content) and announce it to customers.",
        "Build a lightweight analytics sheet logging impressions, clicks, sign-ups, and conversions."
      ]
    },
    {
      "type": "protip",
      "title": "Repurpose Everything",
      "content": "Turn one long-form article into social clips, quotes, and email snippets—maximize every minute you invest.",
      "icon": "repeat"
    }
  ]
}
