{
  "title": "Power of Attorney and Healthcare Directives",
  "type": "reading",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Planning for Incapacity",
      "subtitle": "Documents that protect you when you can't make decisions"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Types of powers of attorney and when they're used",
        "Healthcare directives and living wills",
        "How to choose appropriate agents",
        "When these documents become effective"
      ]
    },
    {
      "type": "content",
      "title": "Financial Power of Attorney",
      "content": "A financial power of attorney (POA) authorizes someone to handle your financial affairs if you become incapacitated. It can be immediate (effective now) or springing (effective only upon incapacity). Choose an agent who is trustworthy, organized, and understands your financial situation and wishes."
    },
    {
      "type": "keypoints",
      "title": "Types of Financial Powers of Attorney",
      "points": [
        {
          "title": "General POA",
          "description": "Broad authority over all financial matters - use only for someone you completely trust."
        },
        {
          "title": "Limited POA",
          "description": "Specific authority for particular transactions or time periods - more restrictive and safer."
        },
        {
          "title": "Durable POA",
          "description": "Remains effective even after incapacity - essential for long-term planning."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Healthcare Documents Are Separate",
      "content": "Financial POA doesn't cover healthcare decisions. You need separate healthcare documents to ensure your medical wishes are followed.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Healthcare Directives",
      "content": "Healthcare power of attorney designates someone to make medical decisions for you. A living will specifies your wishes for end-of-life care. These documents should be consistent and discussed with your chosen agents. They typically become effective only when you're unable to make decisions yourself."
    },
    {
      "type": "actionsteps",
      "title": "Complete Your Incapacity Planning",
      "steps": [
        "Choose agents for financial and healthcare decisions based on trust and reliability",
        "Draft a durable financial power of attorney with appropriate scope",
        "Create a healthcare power of attorney and living will",
        "Provide copies to your agents, doctor, and lawyer, and keep originals in a safe place"
      ]
    },
    {
      "type": "protip",
      "title": "Review and Update Regularly",
      "content": "Relationships change over time. Review your POA and healthcare documents every few years or after major life events to ensure your chosen agents are still appropriate."
    }
  ]
}
