{
  "title": "Wills and Trusts Basics",
  "type": "reading",
  "duration": "24 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Build the Blueprint for Your Legacy",
      "subtitle": "Understand how wills and trusts distribute assets, protect heirs, and reduce probate headaches"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Key components of a legally enforceable will",
        "How revocable and irrevocable trusts differ",
        "Strategies for naming executors, guardians, and beneficiaries",
        "When to revisit documents after life changes"
      ]
    },
    {
      "type": "content",
      "title": "Why Every Adult Needs a Plan",
      "content": "Without documented wishes, state intestacy laws decide who receives your assets and who manages the process. A will and, when appropriate, a trust provide clarity, speed, and privacy for loved ones."
    },
    {
      "type": "keypoints",
      "title": "Will Essentials",
      "points": [
        {
          "title": "Testator & Executor",
          "description": "You (the testator) state your wishes; the executor carries them out. Choose someone organized, trustworthy, and available."
        },
        {
          "title": "Guardianship",
          "description": "Name guardians for minor children; have a conversation before listing them to confirm willingness."
        },
        {
          "title": "Asset Instructions",
          "description": "Detail how property, accounts, and personal items are distributed. Use percentages or tiers to stay flexible."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Trusts Add Control",
      "content": "Trusts allow you to manage how and when beneficiaries receive assets—ideal for minor children, blended families, or special-needs planning.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Estate Basics Checklist",
      "steps": [
        "Inventory major assets and liabilities.",
        "List guardians, executors, and backup choices.",
        "Draft instructions for personal property and digital accounts.",
        "Consult an estate attorney to tailor documents to your state.",
        "Store documents securely and share locations with trusted contacts."
      ]
    },
    {
      "type": "protip",
      "title": "Update After Milestones",
      "content": "Revisit documents after marriage, divorce, births, major purchases, or moving across state lines.",
      "icon": "refresh-cw"
    }
  ]
}
