{
  "title": "Estate Tax Planning",
  "type": "exercise",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Minimizing Estate Taxes",
      "subtitle": "Strategies to preserve wealth for your heirs"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Federal and state estate tax exemptions and rates",
        "Common estate tax reduction strategies",
        "Gifting strategies and their tax implications",
        "How life insurance fits into estate planning"
      ]
    },
    {
      "type": "content",
      "title": "Understanding Estate Tax Exemptions",
      "content": "For 2024, the federal estate tax exemption is $13.61 million per person ($27.22 million for married couples). Estates above this amount are taxed at rates up to 40%. Many states have their own estate or inheritance taxes with lower exemptions. The exemption amount is scheduled to revert to about $7 million (inflation-adjusted) in 2026 unless Congress acts."
    },
    {
      "type": "keypoints",
      "title": "Estate Tax Reduction Strategies",
      "points": [
        {
          "title": "Annual Gifting",
          "description": "Give up to $18,000 per person per year ($36,000 for married couples) without gift tax consequences."
        },
        {
          "title": "Lifetime Exemption Gifts",
          "description": "Use your lifetime gift tax exemption to transfer assets during life, potentially reducing future estate taxes."
        },
        {
          "title": "Irrevocable Trusts",
          "description": "Remove assets from your estate while maintaining some control through trusts like GRATs or QPRTs."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Marital Deduction is Unlimited",
      "content": "Assets left to a surviving spouse are not subject to estate tax due to the unlimited marital deduction. However, this defers rather than eliminates the tax unless proper planning is done.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Life Insurance and Estate Taxes",
      "content": "Life insurance proceeds are generally income tax-free but are included in your estate for estate tax purposes if you own the policy. Irrevocable life insurance trusts (ILITs) can remove insurance from your estate while still providing liquidity for estate taxes and other expenses."
    },
    {
      "type": "actionsteps",
      "title": "Plan Your Estate Tax Strategy",
      "steps": [
        "Calculate your potential estate tax liability using current exemption amounts",
        "Consider annual gifting to reduce your taxable estate over time",
        "Review life insurance ownership and beneficiary designations",
        "Consult with an estate planning attorney about advanced strategies if your estate exceeds exemption amounts"
      ]
    },
    {
      "type": "protip",
      "title": "Start Early",
      "content": "Estate tax planning is most effective when started early. Strategies like gifting and trusts work better over longer time horizons, allowing assets to appreciate outside your estate."
    }
  ]
}
