{
  "title": "Estate Planning for Business Owners",
  "type": "reading",
  "duration": "25 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Protect Your Company and Your Heirs",
      "subtitle": "Ensure continuity, fair valuation, and tax efficiency for closely held businesses"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Why succession planning matters long before retirement",
        "Buy-sell agreement structures and funding options",
        "How to value the business for estate and gift planning",
        "Coordinating business interests with personal estate documents"
      ]
    },
    {
      "type": "content",
      "title": "Succession Starts Now",
      "content": "Identify who will run the business if you’re incapacitated or pass away. Decide whether heirs, partners, or key employees assume control, and document training plans and decision authority."
    },
    {
      "type": "keypoints",
      "title": "Owner-Specific Tools",
      "points": [
        {
          "title": "Buy-Sell Agreements",
          "description": "Set terms for ownership transfer triggered by death, disability, or retirement—funded via insurance or installment payments."
        },
        {
          "title": "Valuation Methods",
          "description": "Engage professional appraisers or use formula-based valuations to support tax filings and equitable distributions."
        },
        {
          "title": "Key Person Insurance",
          "description": "Protect cash flow by insuring critical leaders whose absence would disrupt operations."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Separate Roles from Ownership",
      "content": "Clarify which heirs actively manage the company versus those receiving passive ownership or buyouts to reduce conflict.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Integrate With Your Estate Plan",
      "content": "Align business documents with personal wills, trusts, and beneficiary designations. Consider family limited partnerships or transfer-on-death registrations for smoother transitions."
    },
    {
      "type": "actionsteps",
      "title": "Business Estate Checklist",
      "steps": [
        "Document leadership succession and emergency management procedures.",
        "Review buy-sell agreements with partners and update funding sources.",
        "Obtain an independent business valuation and store it with estate records.",
        "Coordinate with tax and legal advisors to structure transfers, trusts, or family limited partnerships.",
        "Communicate the plan to stakeholders to set expectations and minimize disputes."
      ]
    },
    {
      "type": "protip",
      "title": "Plan for Liquidity",
      "content": "Estate taxes or buyouts may require cash—line up life insurance or credit facilities so heirs aren’t forced to sell quickly.",
      "icon": "dollar-sign"
    }
  ]
}
