{
  "title": "Power of Attorney and Healthcare Directives",
  "type": "reading",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Empower Trusted Voices When You Can't Decide",
      "subtitle": "Design financial and medical directives that speak for you during incapacity"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Differences between durable, springing, and limited powers of attorney",
        "Key elements of healthcare proxies and living wills",
        "How to choose and prepare your agents",
        "Storage and communication best practices"
      ]
    },
    {
      "type": "content",
      "title": "Financial Power of Attorney",
      "content": "A durable power of attorney lets a trusted agent manage finances if you're unable. Define the scope clearly—banking, real estate, tax matters—and discuss responsibilities before naming someone."
    },
    {
      "type": "keypoints",
      "title": "Healthcare Directive Essentials",
      "points": [
        {
          "title": "Healthcare Proxy",
          "description": "Appoints a decision maker when you cannot communicate. Share your values and preferences in advance."
        },
        {
          "title": "Living Will",
          "description": "Outlines treatment choices (life support, pain management, organ donation) to guide caregivers."
        },
        {
          "title": "HIPAA Authorization",
          "description": "Allows medical staff to share information with your proxy and family—critical for smooth coordination."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Keep Originals Accessible",
      "content": "Store signed directives in a fireproof safe and give copies to agents, physicians, and close family members.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Directive Prep Checklist",
      "steps": [
        "List potential agents and note their availability, geographic location, and communication style.",
        "Define your medical preferences regarding life support, pain relief, and end-of-life care.",
        "Consult your healthcare provider to clarify medical terminology and implications.",
        "Execute documents according to state witness/notary requirements.",
        "Upload secure digital copies to a patient portal or cloud vault for rapid access."
      ]
    },
    {
      "type": "protip",
      "title": "Conduct a Family Meeting",
      "content": "Walk through your directives with loved ones to avoid confusion and ensure everyone understands their role.",
      "icon": "users"
    }
  ]
}
