{
  "title": "Estate Tax Planning",
  "type": "exercise",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Minimize Taxes, Maximize Impact",
      "subtitle": "Craft a plan that preserves wealth through gifting, exemptions, and charitable strategies"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "Net worth snapshot with taxable estate estimate",
        "Annual gifting and lifetime exemption tracker",
        "Charitable giving plan using donor-advised funds or trusts",
        "Action worksheet for coordinating with tax and legal advisors"
      ]
    },
    {
      "type": "content",
      "title": "Understand the Thresholds",
      "content": "Estate tax kicks in above federal and (in some cases) state exemption amounts. For high-net-worth families, proactive gifting and trust structures reduce the taxable estate while supporting heirs during your lifetime."
    },
    {
      "type": "keypoints",
      "title": "Tax Reduction Levers",
      "points": [
        {
          "title": "Annual Exclusion Gifts",
          "description": "Gift up to the annual exclusion amount per recipient without filing a gift tax return."
        },
        {
          "title": "Spousal Portability",
          "description": "Elect portability to combine unused federal exemptions between spouses."
        },
        {
          "title": "Charitable Vehicles",
          "description": "Use donor-advised funds or charitable remainder trusts to reduce estate value while supporting causes you love."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Record Every Gift",
      "content": "Meticulous documentation prevents IRS disputes. Track dates, amounts, recipients, and whether Form 709 was filed.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Estate Tax Planning Sprint",
      "steps": [
        "Calculate your projected taxable estate using current net worth and exclusion limits.",
        "List annual gifts you already make and note opportunities to formalize or expand them.",
        "Identify assets suitable for gifting now (e.g., appreciating securities, interests in family businesses).",
        "Draft a charitable giving strategy including vehicles and beneficiaries.",
        "Set a meeting with your CPA/estate attorney to review plan and implement filings."
      ]
    },
    {
      "type": "protip",
      "title": "Leverage Valuation Discounts",
      "content": "Transferring minority interests in family LLCs or partnerships can qualify for valuation discounts, reducing gift values on paper.",
      "icon": "percent"
    }
  ]
}
