{
  "title": "Retirement Planning and Income Strategies",
  "type": "exercise",
  "duration": "35 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Turn Savings Into Sustainable Retirement Income",
      "subtitle": "Coordinate Social Security, pensions, and portfolios to support your lifestyle for decades"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "Timeline of retirement income sources",
        "Withdrawal strategy integrating the 4% rule, guardrails, or buckets",
        "Social Security claiming analysis based on longevity assumptions",
        "Inflation and healthcare cost contingency plan"
      ]
    },
    {
      "type": "content",
      "title": "Layered Income",
      "content": "Cover essential expenses with guaranteed income first (Social Security, pensions, annuities). Use investment portfolios and part-time income for discretionary goals, adjusting withdrawal rates when markets fluctuate."
    },
    {
      "type": "keypoints",
      "title": "Income Strategy Levers",
      "points": [
        {
          "title": "Guardrails",
          "description": "Adjust withdrawals up or down when portfolio values hit predetermined thresholds to preserve longevity."
        },
        {
          "title": "Tax Coordination",
          "description": "Sequence withdrawals from taxable, tax-deferred, and Roth accounts to minimize lifetime taxes."
        },
        {
          "title": "Healthcare Buffer",
          "description": "Set aside funds for Medicare premiums, long-term care, and out-of-pocket costs before increasing discretionary spending."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Delay Social Security When Feasible",
      "content": "Every year you delay benefits past full retirement age boosts payments ~8%, providing valuable longevity insurance.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Retirement Income Workshop",
      "steps": [
        "List guaranteed income sources with start dates and amounts.",
        "Identify your desired lifestyle costs and categorize them into needs vs. wants.",
        "Choose a withdrawal framework (bucket, guardrail, or hybrid) and map how portfolio assets support each bucket.",
        "Model Social Security claiming ages (62, FRA, 70) to compare lifetime benefits.",
        "Stress-test your plan using pessimistic market returns and higher inflation scenarios."
      ]
    },
    {
      "type": "protip",
      "title": "Review Annually",
      "content": "Update your income plan every year—adjust for investment performance, spending changes, and evolving life goals.",
      "icon": "calendar-check"
    }
  ]
}
