{
  "title": "Risk Management and Insurance Planning",
  "type": "reading",
  "duration": "26 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Protect the Plan Before You Grow It",
      "subtitle": "Identify coverage gaps that could derail long-term financial goals"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to size emergency and insurance buffers",
        "Coverage checklists for life, health, disability, and property",
        "Decision framework for self-insuring vs. transferring risk",
        "Annual review cadence to keep policies aligned with life changes"
      ]
    },
    {
      "type": "content",
      "title": "Layer Your Defenses",
      "content": "Start with emergency savings, then add insurance tailored to income, dependents, and asset protection needs. The right mix prevents a single event from wiping out years of progress."
    },
    {
      "type": "keypoints",
      "title": "Coverage Priorities",
      "points": [
        {
          "title": "Income Protection",
          "description": "Disability and life insurance replace earnings so goals remain funded if you can't work."
        },
        {
          "title": "Health Costs",
          "description": "High-deductible plans pair well with HSAs; evaluate out-of-pocket maximums carefully."
        },
        {
          "title": "Asset Safeguards",
          "description": "Home, auto, and umbrella policies shield net worth from lawsuits or catastrophic losses."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Review Beneficiaries",
      "content": "Ensure policy beneficiaries match your estate documents. Misalignment delays payouts and complicates tax planning.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Risk Audit Checklist",
      "steps": [
        "List all existing policies with coverage amounts, premiums, and renewal dates.",
        "Calculate income replacement needs for both short-term disability and long-term support.",
        "Assess health plan options during open enrollment and model worst-case expenses.",
        "Request quotes for umbrella coverage if net worth exceeds liability limits.",
        "Schedule annual insurance review aligned with financial plan check-ins."
      ]
    },
    {
      "type": "protip",
      "title": "Bundle Strategically",
      "content": "Combining policies (home, auto, umbrella) often yields discounts, but verify coverage quality before consolidating.",
      "icon": "shield-check"
    }
  ]
}
