{
  "title": "Creating Your Financial Plan",
  "type": "exercise",
  "duration": "32 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Construct a Holistic Money Strategy",
      "subtitle": "Document goals, cash flow, and priorities in one actionable financial plan"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "Personal balance sheet capturing assets and liabilities",
        "Cash-flow forecast with discretionary spending targets",
        "Goal hierarchy ranked by urgency and impact",
        "Action tracker assigning owners, deadlines, and metrics"
      ]
    },
    {
      "type": "content",
      "title": "Start With Your Baseline",
      "content": "List every account, property, and debt to understand your net worth today. Combine that with a realistic monthly cash-flow statement—income in, expenses out—so you can see resources available for goals."
    },
    {
      "type": "keypoints",
      "title": "Plan Pillars",
      "points": [
        {
          "title": "SMART Goals",
          "description": "Specific, Measurable, Achievable, Relevant, Time-bound—clarity fuels progress."
        },
        {
          "title": "Safety Margin",
          "description": "Build a buffer by earmarking 10-20% of cash flow for unexpected needs before investing aggressively."
        },
        {
          "title": "Review Cadence",
          "description": "Monthly budget check-ins and quarterly goal assessments keep the plan current."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Focus on One Big Win per Quarter",
      "content": "Whether it's paying off a high-interest card or maxing an IRA, concentrating effort prevents overwhelm and builds momentum.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Plan Drafting Workshop",
      "steps": [
        "Compile your latest statements and create a personal balance sheet.",
        "Categorize expenses into needs, wants, and savings to expose optimization opportunities.",
        "Rank top three financial goals and assign dollar targets and timelines.",
        "Map monthly cash allocations that support each goal.",
        "Set calendar reminders for plan reviews and accountability check-ins."
      ]
    },
    {
      "type": "protip",
      "title": "Automate for Consistency",
      "content": "Once allocations are set, automate transfers on payday. Automation removes the friction of manual decisions.",
      "icon": "zap"
    }
  ]
}
