{
  "title": "Building Healthy Money Habits",
  "type": "exercise",
  "duration": "26 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Design Habits That Support Wealth",
      "subtitle": "Tie your values to daily routines so good money behavior becomes automatic"
    },
    {
      "type": "overview",
      "title": "You'll Practice",
      "items": [
        "Linking habits to identity and values",
        "Building cue-based systems for saving and budgeting",
        "Creating friction for unhelpful behaviors",
        "Tracking wins to reinforce commitment"
      ]
    },
    {
      "type": "content",
      "title": "Habit Science Essentials",
      "content": "Financial habits stick when they are small, consistent, and tied to who you believe you are. Every repetition reinforces the identity of being responsible, generous, or growth-minded with money."
    },
    {
      "type": "keypoints",
      "title": "Habit Loop",
      "points": [
        {
          "title": "Cue",
          "description": "The trigger that tells your brain to start the routine (payday, morning coffee)."
        },
        {
          "title": "Routine",
          "description": "The behavior itself—checking accounts, logging expenses, transferring to savings."
        },
        {
          "title": "Reward",
          "description": "The satisfaction or celebration that reinforces repeating the habit."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Two-Minute Rule",
      "content": "Shrink every new habit to an action you can complete in under two minutes to guarantee follow-through.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Make Good Habits Easy",
      "content": "Automate transfers, schedule calendar blocks, and use templates so your system handles routine money tasks. Meanwhile, add friction to spending habits—delete saved cards from shopping apps, or require a 24-hour wait before non-essential purchases."
    },
    {
      "type": "actionsteps",
      "title": "Habit Architecture",
      "steps": [
        "Choose three money habits you want to strengthen (saving, reviewing statements, planning meals).",
        "Define the cue, routine, and reward for each habit. Write it down in a tracker.",
        "Reduce each habit to a simple two-minute version you can always complete.",
        "Identify one habit to add friction to—remove the app, add a spending approval step, or require a waiting period.",
        "Track your completion for 21 days, checking off each repetition to build momentum."
      ]
    },
    {
      "type": "protip",
      "title": "Stack Habits",
      "content": "Attach a new financial habit to something you already do daily—like reviewing accounts right after brushing your teeth at night.",
      "icon": "link"
    }
  ]
}
