{
  "title": "Money Mindset and Beliefs",
  "type": "reading",
  "duration": "25 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Rewrite Your Money Story",
      "subtitle": "Discover how subconscious beliefs drive every financial decision"
    },
    {
      "type": "overview",
      "title": "In This Lesson",
      "items": [
        "Reveal hidden messages you absorbed about money",
        "Understand how identity shapes spending and saving",
        "Learn techniques for reprogramming limiting beliefs",
        "Create new affirmations that support your goals"
      ]
    },
    {
      "type": "content",
      "title": "Your Money Origin Story",
      "content": "Our earliest experiences with money become scripts that run in the background. If you heard phrases like 'money doesn't grow on trees,' you may associate wealth with greed or scarcity. Recognizing these inherited narratives is the first step to changing them."
    },
    {
      "type": "keypoints",
      "title": "Common Limiting Beliefs",
      "points": [
        {
          "title": "Scarcity Programming",
          "description": "Believing there will never be enough can trigger hoarding or overspending when money appears."
        },
        {
          "title": "Success Guilt",
          "description": "Feeling bad about earning more than family or friends leads to self-sabotage."
        },
        {
          "title": "Fear of Responsibility",
          "description": "Worrying about managing larger sums keeps you at the same income level."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Mindset Shift",
      "content": "Beliefs are practiced thoughts. Choose ones that serve your future, not just repeat your past.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Rewire the Narrative",
      "content": "Use cognitive reframing to challenge the old story. When you catch yourself thinking 'I'm bad with money,' replace it with 'I'm learning a new skill every day.' Reinforce the new belief with evidence, like paying a bill on time or contributing to savings."
    },
    {
      "type": "actionsteps",
      "title": "Belief Reset Practice",
      "steps": [
        "List three money beliefs you heard growing up and note how they show up today.",
        "Underline the beliefs that limit you. Write a new empowering statement for each.",
        "Record the reframed statements as voice memos and listen daily for seven days.",
        "Collect proof of progress (receipts, screenshots, journal entries) to reinforce the new mindset.",
        "Share your reframed beliefs with an accountability partner or coach for support."
      ]
    },
    {
      "type": "protip",
      "title": "Affirmation Anchor",
      "content": "Attach a new belief to a daily habit—say 'I am a capable wealth builder' every time you log into online banking.",
      "icon": "star"
    }
  ]
}
