{
  "title": "Investment Planning and Asset Allocation",
  "type": "exercise",
  "duration": "30 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Strategic Investment Planning",
      "subtitle": "Aligning your investments with your goals and risk tolerance"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to determine your investment time horizon and risk tolerance",
        "Strategic vs. tactical asset allocation approaches",
        "Building a diversified portfolio that matches your goals",
        "Monitoring and rebalancing your investment plan"
      ]
    },
    {
      "type": "content",
      "title": "Investment Planning Framework",
      "content": "Effective investment planning starts with clearly defined goals, time horizons, and risk tolerance. Your asset allocation should reflect these factors and be designed to achieve your objectives while managing risk. Regular monitoring and rebalancing ensure your portfolio stays aligned with your plan."
    },
    {
      "type": "keypoints",
      "title": "Key Investment Planning Steps",
      "points": [
        {
          "title": "Define Goals and Time Horizon",
          "description": "Short-term goals (1-3 years) need stability; long-term goals (10+ years) can tolerate more volatility."
        },
        {
          "title": "Assess Risk Tolerance",
          "description": "Consider both your ability to take risk (financial situation) and willingness to take risk (emotional tolerance)."
        },
        {
          "title": "Develop Asset Allocation",
          "description": "Choose an appropriate mix of stocks, bonds, and alternatives based on your goals and risk profile."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Asset Allocation Drives Returns",
      "content": "Studies show that 90%+ of investment returns are determined by asset allocation, not individual security selection or market timing.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Strategic vs. Tactical Allocation",
      "content": "Strategic allocation sets long-term targets based on your goals and risk tolerance. Tactical allocation makes short-term adjustments based on market conditions. Most individual investors benefit from strategic allocation with periodic rebalancing to maintain target allocations."
    },
    {
      "type": "actionsteps",
      "title": "Create Your Investment Plan",
      "steps": [
        "List your financial goals with time horizons and required returns",
        "Complete a risk tolerance questionnaire to determine your profile",
        "Develop a target asset allocation that matches your goals and risk tolerance",
        "Select specific investments and set up automatic contributions and rebalancing"
      ]
    },
    {
      "type": "protip",
      "title": "Keep It Simple",
      "content": "Start with a simple two-fund or three-fund portfolio using low-cost index funds. Add complexity only as your knowledge and portfolio size grow."
    }
  ]
}
