{
  "title": "Money Mindset and Beliefs",
  "type": "reading",
  "duration": "25 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Your Relationship with Money",
      "subtitle": "Understanding how your beliefs about money shape your financial behavior"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How childhood experiences influence money attitudes",
        "Common money scripts and their impact on decisions",
        "Techniques to identify and change limiting beliefs",
        "Building a positive money mindset"
      ]
    },
    {
      "type": "content",
      "title": "Money Scripts: The Stories We Tell Ourselves",
      "content": "Money scripts are unconscious beliefs about money formed in childhood. Common scripts include 'Money is the root of all evil,' 'More money will make me happier,' or 'I'll never be good with money.' These scripts influence our financial decisions, often leading to self-sabotaging behaviors."
    },
    {
      "type": "keypoints",
      "title": "Common Money Scripts",
      "points": [
        {
          "title": "Money Avoidance",
          "description": "Belief that money is bad or that wealthy people are greedy, leading to unconscious efforts to get rid of money."
        },
        {
          "title": "Money Worship",
          "description": "Belief that money solves all problems, leading to overspending and poor financial choices."
        },
        {
          "title": "Money Status",
          "description": "Using money and possessions to define self-worth, often resulting in lifestyle inflation."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Awareness is the First Step",
      "content": "Identifying your money scripts requires honest self-reflection. Journal about your earliest money memories and how they make you feel about money today.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Reframing Your Money Mindset",
      "content": "Once identified, challenge negative money scripts with evidence from your life. Replace 'I'm bad with money' with 'I can learn to manage money effectively.' Surround yourself with positive financial role models and consume educational content that promotes healthy money attitudes."
    },
    {
      "type": "actionsteps",
      "title": "Improve Your Money Mindset",
      "steps": [
        "Write down your earliest money memory and how it affects you today",
        "Identify one money script that's holding you back",
        "Replace it with a positive, actionable belief",
        "Track how this new belief changes your financial decisions for one week"
      ]
    },
    {
      "type": "protip",
      "title": "Money Mindset is a Skill",
      "content": "Like any skill, developing a healthy money mindset takes practice. Be patient with yourself and celebrate small improvements in your financial attitudes and behaviors."
    }
  ]
}
