{
  "title": "Introduction to Money Management",
  "type": "reading",
  "duration": "15 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Welcome to Financial Foundations!",
      "subtitle": "Your journey to financial freedom starts here",
      "image": "/images/lessons/money-management-hero.jpg"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "What money management really means",
        "Why it's crucial for your financial future", 
        "The basic principles that guide smart money decisions",
        "Common mistakes people make with money"
      ]
    },
    {
      "type": "content",
      "title": "Understanding Money Management",
      "content": "Money management is the process of budgeting, saving, investing, spending, or otherwise overseeing the capital usage of an individual or group. It's not just about having money—it's about making your money work for you."
    },
    {
      "type": "highlight",
      "title": "Key Principle",
      "content": "The foundation of all wealth building is spending less than you earn. This simple concept, when applied consistently, creates the surplus needed for saving and investing.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "The Money Management Framework",
      "content": "Effective money management follows a simple framework: Track → Budget → Save → Invest → Protect. Each step builds upon the previous one, creating a solid financial foundation."
    },
    {
      "type": "keypoints",
      "title": "Essential Concepts",
      "points": [
        {
          "title": "Income vs. Expenses",
          "description": "Understanding the difference between money coming in and money going out is fundamental to financial health."
        },
        {
          "title": "The 50/30/20 Rule", 
          "description": "A simple budgeting framework where 50% goes to needs, 30% to wants, and 20% to savings and debt repayment."
        },
        {
          "title": "Emergency Fund",
          "description": "Having 3-6 months of expenses saved for unexpected situations provides financial security and peace of mind."
        }
      ]
    },
    {
      "type": "actionsteps",
      "title": "Your Action Steps",
      "steps": [
        "Track your spending for one week using an app or spreadsheet",
        "Identify your fixed vs. variable expenses",
        "Set one specific financial goal for this month",
        "Open a separate savings account if you don't have one"
      ]
    },
    {
      "type": "protip",
      "title": "Pro Tip",
      "content": "Start small but start today. Even saving $1 per day builds the habit that will serve you for life. The amount matters less than the consistency.",
      "icon": "lightbulb"
    }
  ]
}
