{
  "title": "Life Insurance Planning",
  "type": "reading",
  "duration": "24 min",
  "points": 165,
  "sections": [
    {
      "type": "hero",
      "title": "Protect the People Who Depend on You",
      "subtitle": "Design a life insurance strategy that replaces income, clears debt, and funds future dreams"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to calculate the coverage amount your family actually needs",
        "When to choose term vs. permanent insurance (and when to avoid the hype)",
        "Ways to ladder policies and align them with different financial goals",
        "How to review beneficiaries and riders so your policy keeps pace with life changes"
      ]
    },
    {
      "type": "content",
      "title": "Life Insurance as Income Replacement",
      "content": "The primary mission of life insurance is replacing the economic value you provide. Consider years of income, childcare, education costs, and outstanding debts. A simple approach multiplies annual income by 10, but a tailored plan subtracts existing assets and layers in specific future expenses."
    },
    {
      "type": "keypoints",
      "title": "Term vs. Permanent",
      "points": [
        {
          "title": "Term Life",
          "description": "Pure insurance for a set period (10-40 years). It’s affordable, easy to compare, and flexible enough to ladder multiple policies."
        },
        {
          "title": "Whole Life",
          "description": "Includes a cash value component with guaranteed growth but higher premiums. Consider only after maxing out retirement accounts and securing term coverage."
        },
        {
          "title": "Universal Life Variants",
          "description": "Flexible premiums and death benefits, but complexity and fees demand professional guidance."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Cost Efficiency",
      "content": "Most households only need term insurance. Invest the premium savings in tax-advantaged accounts to build wealth while maintaining protection.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Laddering Strategies",
      "content": "Life expenses decline over time as kids become independent and mortgages shrink. Laddering multiple term policies with staggered end dates aligns coverage with specific goals—e.g., a 20-year policy for college funding and a 30-year policy for income replacement. As assets grow, shorter policies drop off, trimming premiums when protection needs decrease."
    },
    {
      "type": "content",
      "title": "Beneficiaries and Riders",
      "content": "Review beneficiary designations annually or after major life events. Add contingent beneficiaries and consider trusts when minor children are involved. Riders such as waiver of premium, conversion options, or accelerated death benefits can customize protection—evaluate costs versus likelihood of use."
    },
    {
      "type": "actionsteps",
      "title": "Policy Blueprint Workshop",
      "steps": [
        "List the financial obligations you want life insurance to cover (income, debts, college, final expenses)",
        "Subtract existing assets and current savings vehicles that could offset those obligations",
        "Decide on policy laddering (e.g., 10-year + 20-year) to match timelines",
        "Request quotes from at least three reputable carriers or an independent broker",
        "Set a calendar reminder to revisit coverage every 18 months or after major life events"
      ]
    },
    {
      "type": "protip",
      "title": "Document the Plan",
      "content": "Store your policy documents, agent contact info, and coverage explanation in a shared digital vault so beneficiaries can act quickly if needed.",
      "icon": "lightbulb"
    }
  ]
}
