{
  "title": "Health Insurance Basics",
  "type": "reading",
  "duration": "27 min",
  "points": 160,
  "sections": [
    {
      "type": "hero",
      "title": "Decode Your Health Coverage",
      "subtitle": "Master premiums, deductibles, and networks so you can choose the right plan with confidence"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How health insurance spreads medical risk and why premiums vary",
        "The meaning of deductibles, coinsurance, copays, and out-of-pocket maximums",
        "How to evaluate employer, marketplace, and HSA-qualified plans",
        "A step-by-step walkthrough for comparing plan documents"
      ]
    },
    {
      "type": "content",
      "title": "How Health Insurance Works",
      "content": "Health insurance contracts pool medical risk across many members. You pay a predictable premium to avoid unpredictable bills. In exchange, the insurer negotiates discounted rates with providers and covers a large portion of eligible costs once you meet cost-sharing requirements. Understanding the vocabulary empowers you to match a plan to your health needs and cash flow."
    },
    {
      "type": "keypoints",
      "title": "Essential Vocabulary",
      "points": [
        {
          "title": "Premium",
          "description": "The monthly cost to maintain coverage—pay it and your plan stays active regardless of medical usage."
        },
        {
          "title": "Deductible",
          "description": "The amount you pay before insurance starts sharing costs. High-deductible plans pair with HSAs and typically offer lower premiums."
        },
        {
          "title": "Copay vs. Coinsurance",
          "description": "Copays are flat fees per service; coinsurance is a percentage of the cost after the deductible."
        },
        {
          "title": "Out-of-Pocket Maximum",
          "description": "The absolute most you will pay in a plan year for covered care. After you hit it, insurance pays 100% of eligible services."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Coverage Checklist",
      "content": "Your ideal plan keeps your doctors in-network, caps worst-case spending at a level you can handle, and allows tax-advantaged savings if you qualify for an HSA.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Comparing Plan Types",
      "content": "Employer-sponsored plans often subsidize premiums and provide multiple tiers (PPO, HMO, HDHP). Marketplace plans categorize metal tiers—Bronze through Platinum—based on cost sharing. Catastrophic plans exist for people under 30 or with hardship exemptions. Evaluate ten factors: monthly premium, deductible, coinsurance, out-of-pocket maximum, prescription coverage, network size, referral requirements, telehealth availability, HSA eligibility, and embedded vs. aggregate family deductibles."
    },
    {
      "type": "content",
      "title": "Deciding with Data",
      "content": "List your recurring prescriptions, expected doctor visits, and potential life events (surgery, pregnancy). Estimate annual spending under each plan. A higher premium with lower deductible might win if you have chronic conditions. Conversely, a healthy household that can self-insure minor costs might choose an HDHP, invest in an HSA, and benefit from tax deductions plus long-term growth."
    },
    {
      "type": "actionsteps",
      "title": "Plan Comparison Lab",
      "steps": [
        "Download the Summary of Benefits and Coverage (SBC) for each plan you are considering",
        "Highlight deductible, copay/coinsurance structure, and out-of-pocket maximum",
        "List your typical medical services and price them under each plan",
        "Check provider directories to confirm your doctors are in-network",
        "Decide whether HSA eligibility aligns with your savings strategy and open an account if so"
      ]
    },
    {
      "type": "protip",
      "title": "Leverage HSAs",
      "content": "If you choose a high-deductible health plan, fund your Health Savings Account early in the year. Contributions reduce taxable income, grow tax-free, and can be invested for future medical costs or even retirement.",
      "icon": "lightbulb"
    }
  ]
}
