{
  "title": "Auto and Home Insurance Deep Dive",
  "type": "exercise",
  "duration": "32 min",
  "points": 175,
  "sections": [
    {
      "type": "hero",
      "title": "Fortify the Things You Drive and Own",
      "subtitle": "Audit your auto and property policies, plug coverage gaps, and negotiate smarter premiums"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Decode every section of your auto and homeowners (or renters) declarations page",
        "Benchmark liability, collision, and comprehensive limits against real-world replacement costs",
        "Identify discounts and bundling strategies that reduce premiums without sacrificing coverage",
        "Build a renewal checklist you can reuse every policy anniversary"
      ]
    },
    {
      "type": "content",
      "title": "Why Property Coverage Needs Annual Maintenance",
      "content": "Vehicles depreciate, home repair costs rise, and life circumstances change. The coverage you bought three years ago may no longer reflect replacement values or your current risk profile. Treat insurance as a living system: review deductibles, endorsements, and liability limits whenever you add drivers, finish a renovation, or purchase valuable gear."
    },
    {
      "type": "keypoints",
      "title": "Auto Insurance Essentials",
      "points": [
        {
          "title": "Liability Coverage",
          "description": "Pays for injuries and property damage you cause. State minimums are rarely enough—target 100/300/100 or higher if you have assets."
        },
        {
          "title": "Collision vs. Comprehensive",
          "description": "Collision covers your car when you hit something; comprehensive covers theft, weather, and vandalism. Evaluate the car's value to decide deductibles."
        },
        {
          "title": "Uninsured/Underinsured Motorist",
          "description": "Protects you if the other driver has insufficient coverage. Match limits to your liability coverage whenever possible."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Deductible Rule of Thumb",
      "content": "Choose the highest deductible you could comfortably pay out-of-pocket tomorrow. Higher deductibles lower premiums, but only if you can self-insure the difference.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Homeowners & Renters Coverage Layers",
      "content": "Property policies are more than dwelling coverage. Personal property, loss of use, medical payments, and personal liability add up to a comprehensive shield. Inventory belongings with photos or spreadsheets, note expensive items that need scheduled endorsements (jewelry, instruments, collectibles), and verify that coverage limits reflect today’s replacement costs."
    },
    {
      "type": "content",
      "title": "Bundling and Discounts",
      "content": "Insurers reward safe behavior and consolidated business. Common discounts include multi-policy bundles, telematics driving programs, automatic payments, loyalty credits, security systems, and good student rates. Capture the savings but evaluate whether bundling sacrifices coverage quality—compare standalone quotes to keep leverage."
    },
    {
      "type": "actionsteps",
      "title": "Policy Optimization Sprint",
      "steps": [
        "Download the declarations pages for your auto and home/renters policies",
        "List current liability limits, deductibles, and premium amounts for each coverage",
        "Research recommended limits for your state and asset level (use the provided worksheet or links)",
        "Call or email your agent to request quotes for increased liability/umbrella coverage and higher deductibles",
        "Document available discounts, note gaps, and schedule a 12-month renewal review reminder"
      ]
    },
    {
      "type": "content",
      "title": "When to Add Umbrella Coverage",
      "content": "Once your net worth exceeds your auto liability limits, a personal umbrella policy becomes invaluable. For $150–$300 per year, you can add $1–$2 million in additional liability protection that applies after your auto or home policy limits are exhausted."
    },
    {
      "type": "protip",
      "title": "Use Comparison APIs",
      "content": "Web services like The Zebra, Policygenius, or independent agency portals let you pull multiple quotes without a dozen phone calls. Export results to your workbook and track renewal conversations year over year.",
      "icon": "lightbulb"
    }
  ]
}
