{
  "title": "Building a Portfolio",
  "type": "exercise",
  "duration": "35 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Constructing Your Investment Portfolio",
      "subtitle": "Putting together a diversified mix of assets that matches your goals"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to determine your target asset allocation",
        "Selecting specific investments within each asset class",
        "Portfolio construction principles and strategies",
        "Ongoing portfolio management and rebalancing"
      ]
    },
    {
      "type": "content",
      "title": "Asset Allocation Basics",
      "content": "Asset allocation is the process of dividing your investments among different asset classes like stocks, bonds, and cash. This is the most important decision you'll make as an investor, as it determines about 90% of your portfolio's return and risk characteristics. Start with broad categories and then drill down to specific investments."
    },
    {
      "type": "keypoints",
      "title": "Portfolio Construction Steps",
      "points": [
        {
          "title": "Determine Risk Tolerance",
          "description": "Use your risk assessment to decide on an appropriate stock/bond mix."
        },
        {
          "title": "Choose Asset Classes",
          "description": "Select broad categories like domestic stocks, international stocks, bonds, and alternatives."
        },
        {
          "title": "Select Investments",
          "description": "Choose specific funds or securities that represent each asset class."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Keep It Simple",
      "content": "Most investors do best with a simple portfolio of 3-5 low-cost index funds covering major asset classes. Complexity often leads to higher costs and poorer performance.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Rebalancing Your Portfolio",
      "content": "Rebalancing involves periodically adjusting your portfolio back to your target allocation. This ensures you maintain your desired risk level and forces you to sell high and buy low. Set up automatic rebalancing or do it annually/quarterly based on your preference."
    },
    {
      "type": "actionsteps",
      "title": "Build Your Portfolio",
      "steps": [
        "Determine your target stock/bond allocation based on your risk tolerance",
        "Select 3-5 low-cost index funds covering different asset classes",
        "Calculate how much to invest in each fund to reach your target allocation",
        "Set up automatic contributions and rebalancing"
      ]
    },
    {
      "type": "protip",
      "title": "Think Long-Term",
      "content": "Focus on building a portfolio that you can maintain for decades. Avoid frequent changes based on short-term market movements or hot investment trends."
    }
  ]
}
