{
  "title": "Risk Assessment",
  "type": "exercise",
  "duration": "20 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Understanding Your Risk Tolerance",
      "subtitle": "Matching your investments to your comfort level and goals"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to assess your risk tolerance objectively",
        "The relationship between risk and return",
        "How time horizon affects risk capacity",
        "Creating a risk profile for your investments"
      ]
    },
    {
      "type": "content",
      "title": "Risk and Return Fundamentals",
      "content": "Risk and return are inextricably linked in investing. Higher potential returns usually come with higher risk. Your risk tolerance is determined by your ability to take risk (financial situation) and your willingness to take risk (emotional comfort). Understanding both helps you choose appropriate investments."
    },
    {
      "type": "keypoints",
      "title": "Types of Investment Risk",
      "points": [
        {
          "title": "Market Risk",
          "description": "The risk that the overall market will decline, affecting most investments."
        },
        {
          "title": "Inflation Risk",
          "description": "The risk that your investments won't keep pace with rising prices."
        },
        {
          "title": "Liquidity Risk",
          "description": "The risk that you can't sell an investment quickly without significant loss."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Time Horizon is Key",
      "content": "Longer time horizons allow you to take more risk because you have time to recover from market downturns. Short-term goals require more conservative investments.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Assessing Your Risk Tolerance",
      "content": "Consider your investment timeline, financial stability, and emotional response to market volatility. A good rule of thumb is that you should be able to sleep well at night with your investment choices. Use risk tolerance questionnaires from reputable sources to get an objective assessment."
    },
    {
      "type": "actionsteps",
      "title": "Assess Your Risk Profile",
      "steps": [
        "Complete a risk tolerance questionnaire from a trusted financial website",
        "Review your current investment portfolio and note how it makes you feel",
        "Consider your age, job stability, and emergency fund status",
        "Adjust your asset allocation based on your risk assessment"
      ]
    },
    {
      "type": "protip",
      "title": "Risk Tolerance Can Change",
      "content": "Your risk tolerance may evolve as you age, experience life changes, or gain more investment knowledge. Reassess your risk profile every few years or after major life events."
    }
  ]
}
