{
  "title": "Stocks vs Bonds vs Funds",
  "type": "reading",
  "duration": "30 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Understanding Investment Vehicles",
      "subtitle": "The building blocks of every investment portfolio"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "The characteristics and risks of stocks, bonds, and mutual funds",
        "When to choose individual securities vs. funds",
        "Understanding expense ratios and their impact on returns",
        "How to evaluate different investment options"
      ]
    },
    {
      "type": "content",
      "title": "Individual Stocks: Ownership in Companies",
      "content": "When you buy a stock, you own a small piece of a company. Stock prices reflect investor expectations about the company's future profitability. Stocks offer high potential returns but also high volatility. Diversification is crucial when investing in individual stocks to manage risk."
    },
    {
      "type": "keypoints",
      "title": "Investment Types Compared",
      "points": [
        {
          "title": "Stocks",
          "description": "High potential returns, high volatility, require research and diversification, suitable for long-term growth."
        },
        {
          "title": "Bonds",
          "description": "Lower returns, lower risk, provide income and stability, good for preserving capital and generating income."
        },
        {
          "title": "Mutual Funds",
          "description": "Professionally managed pools of stocks/bonds, instant diversification, higher fees but easier for beginners."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Expense Ratios Matter",
      "content": "All funds charge fees expressed as expense ratios. Lower expense ratios (under 0.20%) typically lead to better long-term performance. Index funds usually have lower expenses than actively managed funds.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Choosing Between Individual Securities and Funds",
      "content": "Individual stocks and bonds require significant research and time commitment. Mutual funds and ETFs provide instant diversification and professional management. For most investors, especially beginners, low-cost index funds and ETFs are the best choice for building long-term wealth."
    },
    {
      "type": "actionsteps",
      "title": "Build Your Investment Knowledge",
      "steps": [
        "Research three companies you're familiar with and understand their business models",
        "Compare expense ratios of similar mutual funds or ETFs",
        "Decide on an initial allocation between stocks and bonds based on your risk tolerance",
        "Open a brokerage account and make your first fund purchase"
      ]
    },
    {
      "type": "protip",
      "title": "Start with Index Funds",
      "content": "Index funds that track broad market indices like the S&P 500 typically outperform most actively managed funds over time while charging much lower fees."
    }
  ]
}
