{
  "title": "Investment Basics: Turning Savings Into Wealth",
  "type": "reading",
  "duration": "25 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Why Investing Works",
      "subtitle": "Compounding, risk, and time horizons in plain English"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How compounding grows money even with modest contributions",
        "The tradeoff between risk and reward — and what actually drives returns",
        "Asset classes: cash, bonds, stocks, and broad funds",
        "How to pick a starting allocation you can stick with"
      ]
    },
    {
      "type": "content",
      "title": "Compounding: Quiet Growth, Big Impact",
      "content": "Compounding is growth on top of growth. When your investments earn a return, those earnings get reinvested and begin earning too. The earlier you start, the more time you give compounding to work. Consistency beats perfection: a steady monthly contribution often outperforms sporadic, larger deposits." 
    },
    {
      "type": "keypoints",
      "title": "Return Drivers",
      "points": [
        { "title": "Cash", "description": "Low risk, low return. Great for emergencies, not for long‑term growth." },
        { "title": "Bonds", "description": "Loans to governments or companies. Typically steadier than stocks but lower expected return." },
        { "title": "Stocks", "description": "Ownership slices of businesses. Higher volatility, higher long‑term return potential." },
        { "title": "Funds", "description": "Bundles of many bonds or stocks (index funds/ETFs) that deliver instant diversification at low cost." }
      ]
    },
    {
      "type": "highlight",
      "title": "Costs Matter",
      "content": "Fees quietly erode compounding. Favor broad, low‑cost index funds. A 1% annual fee can cost six figures over a career.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "A Starter Portfolio Framework",
      "content": "Pick an allocation based on time horizon and sleep‑at‑night test. Example: 80% global stock index + 20% total bond index for 10+ year goals. Automate monthly contributions. Rebalance once or twice a year to keep your risk level consistent." 
    },
    {
      "type": "actionsteps",
      "title": "Get Moving This Week",
      "steps": [
        "Open a brokerage or use an existing retirement account.",
        "Choose one global stock index fund and one broad bond fund.",
        "Automate a contribution you can sustain (even $50/mo).",
        "Schedule a calendar reminder to rebalance every 6 months."
      ]
    },
    {
      "type": "protip",
      "title": "Nervous About Volatility?",
      "content": "Use a ‘glidepath’: start at a slightly more conservative mix and step up stock exposure every 6–12 months as your confidence grows."
    }
  ]
}
