{
  "title": "Building an Emergency Fund",
  "type": "reading",
  "duration": "20 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Your Safety Net Starts Here",
      "subtitle": "Design a cash buffer that keeps surprises from becoming setbacks"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How to decide on the right emergency fund target for your life stage",
        "Where to store the money so it stays both safe and accessible",
        "Strategies to build your fund even when cash flow feels tight",
        "How to protect the fund once you hit your goal"
      ]
    },
    {
      "type": "content",
      "title": "Why an Emergency Fund Matters",
      "content": "An emergency fund is your personal insurance policy against job loss, medical bills, car repairs, or other unexpected expenses. Without it, short-term crises can force you into high-interest debt, delaying long-term goals. A dedicated savings buffer lets you respond with confidence instead of panic."
    },
    {
      "type": "keypoints",
      "title": "Setting the Right Target",
      "points": [
        {
          "title": "Baseline Amount",
          "description": "Aim for 3 months of essential expenses if you have stable employment and low dependents."
        },
        {
          "title": "Expanded Cushion",
          "description": "Build toward 6 months (or more) if your income is variable, you support others, or work in a cyclical industry."
        },
        {
          "title": "Micro Goals",
          "description": "Start with a mini target like $500 or one rent payment to build momentum before scaling up."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Quick Formula",
      "content": "Monthly essential expenses × months of coverage = emergency fund goal",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Where to Keep the Fund",
      "content": "Prioritize liquidity and safety. High-yield savings accounts or money market accounts are ideal. Avoid investing emergency cash in stocks or crypto—volatility can reduce your balance when you need it most. Keep the fund separate from everyday spending to reduce temptation."
    },
    {
      "type": "keypoints",
      "title": "Funding Strategies",
      "points": [
        {
          "title": "Automate Transfers",
          "description": "Schedule weekly or bi-weekly transfers right after payday so saving happens before spending."
        },
        {
          "title": "Redirect Windfalls",
          "description": "Split tax refunds, bonuses, and cash gifts—send at least 50% straight to the emergency fund."
        },
        {
          "title": "Trim and Transfer",
          "description": "Identify one disposable expense to pause temporarily and reroute that amount into savings."
        }
      ]
    },
    {
      "type": "content",
      "title": "Protecting the Fund",
      "content": "Once funded, treat emergency savings as off-limits except for true needs: job loss, medical bills, urgent repairs. If you need to withdraw, immediately create a replenishment plan. Review your target annually; life changes like a new child or move may require a larger buffer."
    },
    {
      "type": "actionsteps",
      "title": "Your Next Moves",
      "steps": [
        "List your essential monthly expenses: housing, utilities, groceries, insurance, transportation.",
        "Multiply that number by your desired months of coverage to confirm your goal amount.",
        "Open or designate a separate high-yield savings account dedicated to emergencies.",
        "Set up an automated transfer that fits your budget—consistency beats size.",
        "Schedule a quarterly reminder to review progress and adjust contributions."
      ]
    },
    {
      "type": "protip",
      "title": "Account Label Hack",
      "content": "Rename the account to something motivational like \"Peace of Mind Fund\" to reinforce its purpose and reduce impulse withdrawals.",
      "icon": "shield"
    }
  ]
}
