{
  "title": "Managing Daily Expenses",
  "type": "exercise",
  "duration": "25 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Take Control of Everyday Spending",
      "subtitle": "Build a flexible system that keeps recurring and impulse costs in check"
    },
    {
      "type": "overview",
      "title": "Today's Focus",
      "items": [
        "Audit your current daily spending patterns",
        "Separate fixed, flexible, and impulse categories",
        "Apply practical frameworks to curb leaks",
        "Create a daily spending playbook you can keep using"
      ]
    },
    {
      "type": "content",
      "title": "Clarify How Money Leaves",
      "content": "Daily expenses creep in through convenience purchases, subscriptions, and auto-renewals. Seeing every dollar in context is the first step to controlling it. Start by listing everything you buy in a typical week and highlight the purchases that happen without much thought."
    },
    {
      "type": "keypoints",
      "title": "Expense Buckets",
      "points": [
        {
          "title": "Fixed Essentials",
          "description": "Housing, utilities, groceries—non-negotiable costs that keep life running."
        },
        {
          "title": "Flexible Choices",
          "description": "Dining out, ride-share, coffee runs—spending that can be optimized with intention."
        },
        {
          "title": "Impulse Extras",
          "description": "Streaming add-ons, in-app upgrades, late-night orders—charges triggered by mood rather than plan."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Visibility Creates Choice",
      "content": "You can only improve what you measure. A 10-minute weekly review makes the rest of the month easier.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Frameworks for Smarter Spending",
      "content": "Set guardrails for flexible categories using approaches like the 50/30/20 rule or envelope budgeting. Digital banking apps allow you to create sub-accounts labeled by spending purpose. Each transfer becomes a mini decision that keeps emotions out of the equation."
    },
    {
      "type": "actionsteps",
      "title": "Create Your Daily Spending Playbook",
      "steps": [
        "Export or gather the last 14 days of transactions (bank, card, or app).",
        "Tag every expense as essential, flexible, or impulse—be honest with yourself.",
        "Set a weekly dollar cap for flexible spending and schedule automatic transfers into a dedicated sub-account or prepaid card.",
        "Choose one trigger habit to reduce (for example, limit delivery apps to weekends) and note the replacement action.",
        "Schedule a 10-minute Friday review to track totals and reset for the next week."
      ]
    },
    {
      "type": "protip",
      "title": "Automation Advantage",
      "content": "Use push notifications for specific merchants so you feel the cost in real time instead of at billing cycle end.",
      "icon": "bell"
    }
  ]
}
