{
  "title": "Financial Goal Setting",
  "type": "exercise",
  "duration": "28 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Map Your Next Money Milestones",
      "subtitle": "Translate dreams into measurable financial goals with clear timelines"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Identify goals across short, mid, and long-term horizons",
        "Calculate realistic price tags and due dates",
        "Prioritize based on urgency and impact",
        "Build a monthly contribution plan to stay on track"
      ]
    },
    {
      "type": "content",
      "title": "From Wish to Plan",
      "content": "Goals become actionable when they are Specific, Measurable, Achievable, Relevant, and Time-bound (SMART). This exercise helps you define each element so you always know what to do next—and what to celebrate along the way."
    },
    {
      "type": "keypoints",
      "title": "SMART Goal Snapshot",
      "points": [
        {
          "title": "Specific",
          "description": "Name the exact outcome—'Pay off $3,000 credit card' beats 'Get out of debt'."
        },
        {
          "title": "Measurable",
          "description": "Assign numbers so progress is trackable (amount saved, balance left, target date)."
        },
        {
          "title": "Achievable",
          "description": "Ensure the payment or savings schedule fits your cash flow after essentials."
        },
        {
          "title": "Relevant",
          "description": "Confirm the goal advances a life priority, not just an impulse."
        },
        {
          "title": "Time-bound",
          "description": "Commit to a deadline so you can back into monthly milestones."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Goal Balancing Rule",
      "content": "Have at least one stability goal (safety), one growth goal (future), and one joy goal (quality of life).",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Funding the Goals",
      "content": "For each goal, divide the total cost by the number of months until your deadline. This gives you a target monthly contribution. Align contributions with payday and automate wherever possible to remove friction."
    },
    {
      "type": "actionsteps",
      "title": "Goal Design Workshop",
      "steps": [
        "Brainstorm 3–5 goals and categorize them as short-term (<12 months), mid-term (1–3 years), or long-term (3+ years).",
        "Estimate the total amount required for each goal using real numbers (quotes, research, calculators).",
        "Decide on a target completion date and compute the monthly contribution needed.",
        "Rank the goals by importance and energy—select the top two to fully fund first.",
        "Document your plan in a tracker or spreadsheet and set an automated reminder to review monthly."
      ]
    },
    {
      "type": "protip",
      "title": "Visual Tracking",
      "content": "Use a shared dashboard or habit tracker that shows contributions filling up a progress bar—seeing momentum keeps motivation high.",
      "icon": "trending-up"
    }
  ]
}
