{
  "title": "Financing Investment Properties",
  "type": "reading",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Real Estate Financing Strategies",
      "subtitle": "Mortgage options and financing techniques for investment properties"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Conventional vs. investment property loans",
        "Down payment requirements and loan terms",
        "Creative financing strategies",
        "Managing financing costs and risks"
      ]
    },
    {
      "type": "content",
      "title": "Investment Property Loan Options",
      "content": "Investment property loans typically require larger down payments (20-25%) and have higher interest rates than primary residence loans. Conventional loans, FHA loans (for multi-family), and portfolio loans are common options. Expect stricter underwriting standards for rental properties."
    },
    {
      "type": "keypoints",
      "title": "Loan Types for Investors",
      "points": [
        {
          "title": "Conventional Loans",
          "description": "20% down payment, good credit required, competitive interest rates for qualified borrowers."
        },
        {
          "title": "FHA Loans",
          "description": "Lower down payments (as low as 3.5%) but limited to owner-occupied multi-family properties."
        },
        {
          "title": "Private Money",
          "description": "Loans from private lenders or hard money lenders, higher rates but faster closing and less strict requirements."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Interest Rates Matter",
      "content": "A 1% difference in interest rate on a $200,000 loan can cost $2,000+ annually. Shop multiple lenders and consider rate buydowns for lower long-term costs.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Creative Financing Strategies",
      "content": "Beyond traditional mortgages, consider seller financing, lease options, or partnerships. House hacking (living in one unit of a multi-family property) can help you qualify for better loan terms and generate immediate income."
    },
    {
      "type": "actionsteps",
      "title": "Plan Your Financing Strategy",
      "steps": [
        "Check your credit score and improve it if needed before applying for loans",
        "Compare loan offers from multiple lenders including online platforms",
        "Calculate the impact of different down payment amounts on cash flow",
        "Consider house hacking or other creative strategies for your first property"
      ]
    },
    {
      "type": "protip",
      "title": "Build Lender Relationships",
      "content": "Establish relationships with local banks and credit unions early. They often offer better terms and more flexibility than large national lenders for investment properties."
    }
  ]
}
