{
  "title": "Market Research & Due Diligence",
  "type": "reading",
  "duration": "19 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Know the Market Before You Close",
      "subtitle": "Validate rents, neighborhoods, and red flags so every property matches your strategy"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Collecting neighborhood data that predicts rent growth",
        "Evaluating crime, school, and employment trends",
        "Reviewing seller disclosures, inspections, and title work",
        "Creating a due diligence timeline that keeps deals on track"
      ]
    },
    {
      "type": "content",
      "title": "Start with Location Intelligence",
      "content": "Evaluate job growth, population trends, and infrastructure projects in the submarket. Use census data, municipal plans, and rental comparables to confirm demand. Strong markets show steady absorption, rising wages, and diversified industries."
    },
    {
      "type": "keypoints",
      "title": "Due Diligence Pillars",
      "points": [
        {
          "title": "Physical",
          "description": "Schedule inspections, review maintenance logs, and estimate capital expenditures over the next 5-10 years."
        },
        {
          "title": "Financial",
          "description": "Verify rent rolls, trailing 12-month operating statements, and tax histories. Look for expenses the seller omitted."
        },
        {
          "title": "Legal",
          "description": "Order title reports, confirm zoning compliance, and review leases for clauses that survive closing."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Vacancy Stress Test",
      "content": "Model worst-case scenarios with 10-15% vacancy and higher turnover costs. If the deal still cash flows, you have a resilient property.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Work the Timeline",
      "content": "Create a closing checklist that allocates inspection periods, financing contingencies, and appraisal deadlines. Communicate with your lender and title company weekly so no document falls through the cracks."
    },
    {
      "type": "actionsteps",
      "title": "Due Diligence Checklist",
      "steps": [
        "Map the neighborhood with a drive-by or virtual walk to note amenities, traffic, and nearby developments.",
        "Pull five comparable rentals and sales to validate price-per-door and achievable rents.",
        "Request and review seller docs: rent rolls, leases, expenses, utility bills, insurance claims.",
        "Order a professional inspection and negotiate repair credits based on findings.",
        "Set calendar reminders for contingency deadlines so you can exit if deal-breakers appear."
      ]
    },
    {
      "type": "protip",
      "title": "Talk to Neighbors",
      "content": "Chat with adjacent owners or tenants—they reveal realities about noise, maintenance issues, and local demand before you commit.",
      "icon": "message-circle"
    }
  ]
}
