{
  "title": "Analyzing Investment Properties",
  "type": "exercise",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Evaluating Real Estate Investments",
      "subtitle": "Financial analysis techniques for rental property investments"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Key financial metrics for property analysis",
        "How to estimate rental income and expenses",
        "Calculating cash flow and return on investment",
        "Risk assessment for rental properties"
      ]
    },
    {
      "type": "content",
      "title": "Essential Property Metrics",
      "content": "Before investing in rental property, analyze the numbers thoroughly. Key metrics include net operating income (NOI), cash-on-cash return, cap rate, and internal rate of return (IRR). These help you compare properties and make informed decisions."
    },
    {
      "type": "keypoints",
      "title": "Key Analysis Metrics",
      "points": [
        {
          "title": "Cap Rate",
          "description": "Net operating income divided by purchase price - measures property profitability."
        },
        {
          "title": "Cash-on-Cash Return",
          "description": "Annual pre-tax cash flow divided by total cash invested - your actual return on invested capital."
        },
        {
          "title": "NOI (Net Operating Income)",
          "description": "Rental income minus operating expenses - doesn't include financing costs."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Conservative Assumptions Win",
      "content": "When analyzing properties, use conservative estimates for rent, vacancy rates, and expenses. The goal is to buy properties that work even in less-than-ideal conditions.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Estimating Income and Expenses",
      "content": "Research comparable properties to estimate realistic rental income. Factor in 5-10% vacancy rate and account for all expenses: property taxes, insurance, maintenance (1% of property value annually), property management (8-12% of rent), and utilities if not paid by tenants."
    },
    {
      "type": "actionsteps",
      "title": "Analyze a Potential Investment",
      "steps": [
        "Research comparable rental properties in the area",
        "Estimate realistic rental income and all operating expenses",
        "Calculate NOI, cap rate, and cash-on-cash return",
        "Stress test your assumptions with higher vacancy and expenses"
      ]
    },
    {
      "type": "protip",
      "title": "Location Drives Returns",
      "content": "Properties in growing areas with job growth, good schools, and amenities typically perform better than those in declining areas. Focus on location first, then the property."
    }
  ]
}
