{
  "title": "Analyzing Investment Properties",
  "type": "exercise",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Turn Listings into Numbers You Can Trust",
      "subtitle": "Build an underwriting workflow that reveals true cash flow and risk before you make an offer"
    },
    {
      "type": "overview",
      "title": "What You'll Practice",
      "items": [
        "Gathering the expenses sellers forget to mention",
        "Building a quick-and-dirty pro forma in under 10 minutes",
        "Stress-testing rent, vacancy, and repair assumptions",
        "Calculating cap rate, cash-on-cash, and break-even occupancy"
      ]
    },
    {
      "type": "content",
      "title": "Start With Net Operating Income",
      "content": "Collect rental income, subtract vacancy reserves, and deduct all operating expenses (taxes, insurance, maintenance, management, utilities). The result is net operating income (NOI)—the foundation for every valuation metric."
    },
    {
      "type": "keypoints",
      "title": "Deal Metrics",
      "points": [
        {
          "title": "Cap Rate",
          "description": "NOI divided by purchase price; use it to compare deals in the same market segment."
        },
        {
          "title": "Cash-on-Cash Return",
          "description": "Annual pre-tax cash flow divided by cash invested (down payment + closing + rehab)."
        },
        {
          "title": "Debt Service Coverage",
          "description": "NOI divided by annual debt payments—aim for 1.2x or higher to keep lenders comfortable."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Underwrite Repairs Honestly",
      "content": "Budget 1–2% of property value per year for repairs plus a reserve for capital expenditures like roofs and HVAC.",
      "color": "orange"
    },
    {
      "type": "actionsteps",
      "title": "Underwriting Sprint",
      "steps": [
        "Download a recent listing and pull public data for taxes, square footage, and last sale price.",
        "Estimate market rent using comparable listings and adjust for bedrooms, condition, and parking.",
        "Build a one-page pro forma with income, vacancy, expenses, and loan terms.",
        "Compute cap rate, cash-on-cash return, and DSCR using your assumptions.",
        "Create a stress-test tab that shifts rent ±5% and expenses ±10% to see sensitivity."
      ]
    },
    {
      "type": "protip",
      "title": "Save Your Template",
      "content": "Keep your pro forma in the cloud so every new property can be analyzed in minutes instead of hours.",
      "icon": "file-text"
    }
  ]
}
