{
  "title": "Real Estate Investment Basics",
  "type": "reading",
  "duration": "20 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Why Real Estate Belongs in a Wealth Plan",
      "subtitle": "Understand property types, returns, and risks before you buy your first door"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Core ways investors make money from property",
        "How leverage amplifies returns and risk",
        "Key metrics to evaluate any deal",
        "Where real estate fits inside a diversified portfolio"
      ]
    },
    {
      "type": "content",
      "title": "Income Streams",
      "content": "Rental property returns come from cash flow, loan amortization, tax benefits, and appreciation. Cash flow is the rent left after operating expenses and debt service. Even break-even cash flow can be attractive when rents and property values rise over time."
    },
    {
      "type": "keypoints",
      "title": "Property Categories",
      "points": [
        {
          "title": "Single-Family & Small Multifamily",
          "description": "Easier to finance, often managed by the owner, and good for first-time investors."
        },
        {
          "title": "Commercial & Large Multifamily",
          "description": "Valued based on net operating income; often require experienced teams and different financing."
        },
        {
          "title": "Passive Vehicles",
          "description": "REITs, syndications, and crowdfunding platforms offer diversification without landlording duties."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Use Leverage Deliberately",
      "content": "Financing magnifies both gains and losses. Make sure rents cover principal, interest, taxes, insurance, and maintenance with a cushion for vacancies.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Return Metrics",
      "content": "Cap rate, cash-on-cash return, and internal rate of return (IRR) each tell a story. Cap rate shows how much the property earns before financing; cash-on-cash focuses on the equity you invest; IRR weighs cash flows over time. Compare multiple metrics before committing capital."
    },
    {
      "type": "actionsteps",
      "title": "First Deal Prep",
      "steps": [
        "Define your investment goal: cash flow, appreciation, or diversification.",
        "Research local rents and price trends using MLS data or rental platforms.",
        "List the financing options available to you (conventional, portfolio loans, HELOC).",
        "Interview two property managers to understand operating costs and tenant screening.",
        "Run quick math on three properties to compare cap rate and cash-on-cash return."
      ]
    },
    {
      "type": "protip",
      "title": "Stay Data Driven",
      "content": "Track each prospective property in a spreadsheet so emotion never overrides the numbers.",
      "icon": "bar-chart"
    }
  ]
}
