{
  "title": "Financing Investment Properties",
  "type": "reading",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Structure the Right Loan for Every Deal",
      "subtitle": "Compare conventional, portfolio, and creative financing so your numbers stay resilient"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How lenders underwrite investment properties",
        "Differences between conventional, DSCR, and portfolio loans",
        "When to consider seller financing or equity partners",
        "Ways to prep your credit and documents before applying"
      ]
    },
    {
      "type": "content",
      "title": "Lending Basics",
      "content": "Owner-occupied loans generally offer lower rates and down payments but require you to live in the property. Non-owner-occupied loans expect 20-25% down, higher reserves, and rent schedules. Lenders analyze property income and your personal debt-to-income ratio to gauge risk."
    },
    {
      "type": "keypoints",
      "title": "Financing Paths",
      "points": [
        {
          "title": "Conventional Loans",
          "description": "Best for 1-4 unit properties with strong borrowers; fixed rates and 30-year amortization keep payments predictable."
        },
        {
          "title": "Debt-Service-Coverage Ratio (DSCR) Loans",
          "description": "Qualify primarily on the property's cash flow; ideal for investors with multiple mortgages or limited W-2 income."
        },
        {
          "title": "Portfolio & Commercial Loans",
          "description": "Banks keep these loans on their books, offering flexibility for mixed-use or larger properties at higher rates."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Mind the Reserves",
      "content": "Most lenders want six months of mortgage payments in reserves for each financed property. Build this buffer into your acquisition plan.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Creative Structures",
      "content": "Seller financing, lease options, and partnerships can bridge gaps when bank financing falls short. Negotiate interest, amortization, and exit terms carefully—put everything in writing and consult legal counsel."
    },
    {
      "type": "actionsteps",
      "title": "Financing Prep Checklist",
      "steps": [
        "Pull your credit report and address any derogatory marks before applying.",
        "Compile two years of tax returns, recent pay stubs, and a personal financial statement.",
        "Create a one-page summary of the target property including rent roll, expenses, and projected DSCR.",
        "Contact three lenders (conventional, DSCR, portfolio) to compare terms and fees.",
        "Model how rate changes impact cash flow so you know your break-even DSCR."
      ]
    },
    {
      "type": "protip",
      "title": "Build Lender Relationships",
      "content": "Even if you don't have a deal yet, introduce yourself to local lenders so they recognize you when the right property appears.",
      "icon": "handshake"
    }
  ]
}
