{
  "title": "Retirement Withdrawal Strategies",
  "type": "exercise",
  "duration": "28 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Making Your Money Last",
      "subtitle": "Strategies for withdrawing from retirement accounts sustainably"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "The 4% rule and other withdrawal strategies",
        "Tax-efficient withdrawal sequencing",
        "Required minimum distributions (RMDs)",
        "Adjusting withdrawals for market conditions"
      ]
    },
    {
      "type": "content",
      "title": "Sustainable Withdrawal Strategies",
      "content": "The 4% rule suggests withdrawing 4% of your portfolio in year one, then adjusting for inflation. More conservative approaches use 3-3.5% for longer retirements. Dynamic strategies adjust withdrawals based on portfolio performance, reducing spending in down years."
    },
    {
      "type": "keypoints",
      "title": "Withdrawal Strategy Options",
      "points": [
        {
          "title": "Fixed Percentage",
          "description": "Withdraw a fixed percentage annually, adjusting for inflation and portfolio performance."
        },
        {
          "title": "Fixed Dollar Amount",
          "description": "Withdraw the same dollar amount annually, increasing with inflation."
        },
        {
          "title": "Dynamic Strategies",
          "description": "Adjust withdrawals based on market performance and remaining life expectancy."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Tax-Efficient Sequencing",
      "content": "Withdraw from taxable accounts first, then tax-deferred accounts, then Roth accounts to minimize taxes and maximize after-tax income.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Required Minimum Distributions",
      "content": "RMDs are mandatory withdrawals from tax-deferred retirement accounts starting at age 73 (for those born after 1950). These are calculated based on your account balance and life expectancy. Failure to take RMDs results in significant penalties."
    },
    {
      "type": "actionsteps",
      "title": "Plan Your Withdrawal Strategy",
      "steps": [
        "Calculate your sustainable withdrawal rate based on your portfolio size and life expectancy",
        "Plan the order of account withdrawals for tax efficiency",
        "Set up automatic RMD calculations and withdrawals",
        "Monitor your withdrawal rate annually and adjust as needed"
      ]
    },
    {
      "type": "protip",
      "title": "Flexibility is Key",
      "content": "Life circumstances and market conditions change. Build flexibility into your withdrawal plan and be prepared to adjust spending based on how your investments perform."
    }
  ]
}
