{
  "title": "Healthcare in Retirement",
  "type": "reading",
  "duration": "25 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Plan for Healthcare Costs",
      "subtitle": "Estimate Medicare, supplemental insurance, and long-term care expenses"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How Medicare Parts A, B, C, and D cover different services",
        "What Medigap and Medicare Advantage plans add",
        "Projected national healthcare costs in retirement",
        "Ways to hedge against long-term care expenses"
      ]
    },
    {
      "type": "content",
      "title": "Medicare Basics",
      "content": "Medicare Part A covers hospital care and is usually premium-free if you've paid payroll taxes. Part B covers outpatient services and has a monthly premium based on income. Part D covers prescription drugs. Part C (Medicare Advantage) bundles services with private insurers, often including dental and vision. Enrollment windows matter—missing them triggers penalties." 
    },
    {
      "type": "keypoints",
      "title": "Supplemental Coverage",
      "points": [
        {
          "title": "Medigap Plans",
          "description": "Standardized policies that fill cost-sharing gaps in Original Medicare (Parts A & B). Monthly premiums vary by age and location." 
        },
        {
          "title": "Medicare Advantage",
          "description": "Combines hospital, medical, and often drug coverage. Lower premiums but restricted provider networks and potential copays." 
        },
        {
          "title": "IRMAA",
          "description": "Income-Related Monthly Adjustment Amount adds surcharges to Parts B & D if modified adjusted gross income exceeds set thresholds." 
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Cost Snapshot",
      "content": "Fidelity estimates a 65-year-old couple retiring in 2025 will spend about $350,000 on healthcare during retirement, excluding long-term care.",
      "color": "yellow"
    },
    {
      "type": "content",
      "title": "Long-Term Care Planning",
      "content": "Medicare does not cover extended custodial care. Evaluate hybrid life insurance policies, traditional long-term care insurance, or self-funding through earmarked savings. Planning early keeps premiums lower and broadens your coverage options." 
    },
    {
      "type": "actionsteps",
      "title": "Healthcare Checklist",
      "steps": [
        "Estimate annual Medicare Part B and D premiums using your current income.",
        "Compare at least two Medigap and two Medicare Advantage plans in your zip code using Medicare.gov.",
        "Project out-of-pocket costs (deductibles, copays, dental) in your retirement budget.",
        "Research long-term care insurance options and note premium ranges versus self-funding.",
        "Set a reminder to review coverage during the annual open enrollment period (Oct 15-Dec 7)." 
      ]
    },
    {
      "type": "protip",
      "title": "Use HSAs Strategically",
      "content": "Contribute the maximum to a Health Savings Account (HSA) while eligible and invest the funds. Withdraw tax-free for qualified medical expenses in retirement.",
      "icon": "lightbulb"
    }
  ]
}
