{
  "title": "Retirement Withdrawal Strategies",
  "type": "exercise",
  "duration": "28 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Turn Savings into Sustainable Income",
      "subtitle": "Design a withdrawal plan that balances longevity risk, taxes, and market volatility"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Understand sequencing risk and withdrawal rules",
        "Compare fixed, variable, and guardrail withdrawal methods",
        "Organize accounts for tax-efficient distributions",
        "Create a personal withdrawal policy statement"
      ]
    },
    {
      "type": "content",
      "title": "Decumulation Challenges",
      "content": "Retirement income planning flips accumulation on its head. Sequence-of-returns risk means early market losses can drain portfolios faster if withdrawals stay constant. Blending flexible withdrawal policies with cash buffers helps smooth income during downturns." 
    },
    {
      "type": "keypoints",
      "title": "Popular Strategies",
      "points": [
        {
          "title": "4% Rule",
          "description": "Inflation-adjusted withdrawals starting at 4% of the portfolio historically lasted 30 years for balanced portfolios, but requires flexibility during weak markets." 
        },
        {
          "title": "Guardrail Method",
          "description": "Withdraw a starting percentage but adjust up or down if portfolio growth crosses preset guardrails (e.g., +/- 20%)." 
        },
        {
          "title": "Bucket Strategy",
          "description": "Segment assets into cash (0-3 years), bonds (3-10 years), and stocks (10+ years) so you can ride out equity volatility." 
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Tax-Smart Order",
      "content": "A common sequence: taxable accounts first, then tax-deferred (traditional IRA/401(k)), saving Roth accounts for last. Adjust based on tax brackets and required minimum distributions (RMDs).",
      "color": "blue"
    },
    {
      "type": "content",
      "title": "Account Coordination",
      "content": "Track required minimum distributions starting at age 73. Blend withdrawals with Social Security, pensions, and annuities. Execute Roth conversions in low-income years to reduce future RMDs and Medicare surcharges." 
    },
    {
      "type": "actionsteps",
      "title": "Withdrawal Strategy Workshop",
      "steps": [
        "List guaranteed income sources for each year of retirement.",
        "Select a withdrawal method (4% rule, guardrail, or bucket) and document why it fits your risk tolerance.",
        "Create a 12-month cash flow calendar showing which accounts fund each month's expenses.",
        "Draft rules for adjusting withdrawals after market gains or losses (e.g., cut 10% if portfolio falls 15%).",
        "Schedule annual reviews to reassess tax brackets, RMDs, and spending needs."
      ]
    },
    {
      "type": "protip",
      "title": "Use Dynamic Guardrails",
      "content": "Set a floor and ceiling for withdrawals (e.g., 3% minimum, 5% maximum). Staying within the range keeps income stable while protecting portfolio longevity.",
      "icon": "lightbulb"
    }
  ]
}
