{
  "title": "Healthcare in Retirement",
  "type": "reading",
  "duration": "25 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Healthcare Planning for Retirement",
      "subtitle": "Understanding Medicare, supplemental insurance, and long-term care"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Medicare enrollment and coverage options",
        "Medicare supplements and advantage plans",
        "Long-term care insurance considerations",
        "Healthcare cost planning strategies"
      ]
    },
    {
      "type": "content",
      "title": "Medicare Basics",
      "content": "Medicare is the federal health insurance program for people 65 and older. It consists of Part A (hospital insurance), Part B (medical insurance), Part C (Medicare Advantage), and Part D (prescription drug coverage). Enrollment typically begins 3 months before your 65th birthday."
    },
    {
      "type": "keypoints",
      "title": "Medicare Parts Explained",
      "points": [
        {
          "title": "Part A",
          "description": "Hospital stays, skilled nursing care, hospice - premium-free for most people."
        },
        {
          "title": "Part B",
          "description": "Doctor visits, outpatient care, preventive services - monthly premium required."
        },
        {
          "title": "Part D",
          "description": "Prescription drug coverage through private insurance companies."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Enrollment Timing Matters",
      "content": "You have a 7-month initial enrollment period around your 65th birthday. Missing this can result in late enrollment penalties and gaps in coverage.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Supplemental Insurance Options",
      "content": "Medicare doesn't cover everything, so most people need supplemental coverage. Medigap policies fill gaps in Original Medicare, while Medicare Advantage plans provide all-in-one coverage through private insurers. Long-term care insurance covers extended care needs that Medicare doesn't cover."
    },
    {
      "type": "actionsteps",
      "title": "Plan Your Healthcare Coverage",
      "steps": [
        "Research Medicare options 6-12 months before turning 65",
        "Compare Medigap policies or Medicare Advantage plans in your area",
        "Consider long-term care insurance if you have significant assets to protect",
        "Estimate your healthcare costs and include them in your retirement budget"
      ]
    },
    {
      "type": "protip",
      "title": "Healthcare Costs Rise with Age",
      "content": "Healthcare expenses typically increase significantly after age 70. Plan for these costs to avoid depleting your retirement savings on medical care."
    }
  ]
}
