{
  "title": "Psychology of Spending Triggers",
  "type": "reading",
  "duration": "18 min",
  "points": 50,
  "sections": [
    {
      "type": "hero",
      "title": "Understand the Urges Behind Every Swipe",
      "subtitle": "Spot emotional and environmental triggers so you can stay consistent with your saving goals"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "Why impulse purchases happen even when you know better",
        "Common emotional triggers and how to create friction before spending",
        "Environmental cues—like email promotions and friends—that nudge you to spend",
        "Habit loops that retrain your brain to pause, plan, and redirect money to savings"
      ]
    },
    {
      "type": "content",
      "title": "The Impulse Purchase Loop",
      "content": "An impulse buy usually starts with a trigger (stress, boredom, celebration), continues with a craving (\"I deserve this\"), and ends with a reward (temporary mood boost). Recognizing the loop lets you insert a pause—like breathing exercises or a quick budget check—before the swipe." 
    },
    {
      "type": "keypoints",
      "title": "Common Spending Triggers",
      "points": [
        {
          "title": "Emotional Comfort",
          "description": "Stress and anxiety often send you to online carts for dopamine. Build alternative comfort rituals—walks, journaling, text a friend."
        },
        {
          "title": "Social Influence",
          "description": "From brunch invites to group trips, social pressure can override personal priorities. Share your savings goals so friends understand your boundaries." 
        },
        {
          "title": "Marketing Nudges",
          "description": "Urgent emails and limited-time offers exploit loss aversion. Use inbox filters and unsubscribes to reduce exposure." 
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Habit Replace, Don’t Just Remove",
      "content": "Replacing the ‘buy something’ reward with a new habit—like moving the intended purchase amount to savings—keeps the brain satisfied while boosting your future self.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Design Your Pause Ritual",
      "content": "Create a 3-step ritual that slows spending: 1) Name the trigger you feel, 2) Check the goal you’re prioritizing this month, 3) Set a 24-hour wait before buying. Repeat this loop enough times and the pause becomes automatic, making saving the default choice." 
    },
    {
      "type": "actionsteps",
      "title": "Build Your Trigger Shields",
      "steps": [
        "List three emotional triggers that lead to unexpected spending and note the sensations that show up in your body.",
        "Create a ‘cool-down menu’ of quick alternatives—call a friend, make tea, review your savings dashboard.",
        "Unsubscribe or filter marketing emails and delete shopping apps from your phone.",
        "Share your #1 savings priority with someone you trust so they can support your decisions.",
        "Track avoided impulse buys in a win journal and transfer the amount saved to your goal account each week."
      ]
    },
    {
      "type": "protip",
      "title": "Gamify the Pause",
      "content": "Set a streak counter for days you redirected a trigger into savings. Reward yourself with a planned splurge when you hit 30 days.",
      "icon": "trophy"
    }
  ]
}
