{
  "title": "Understanding Compound Interest",
  "type": "reading",
  "duration": "26 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Make Time Work for You",
      "subtitle": "See how compound interest quietly multiplies every disciplined contribution"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How compound interest actually grows your savings balance",
        "Why time horizon beats contribution size in the early years",
        "How compounding frequency and rate shifts affect your outcome",
        "A blueprint for maximizing compounding across goals"
      ]
    },
    {
      "type": "content",
      "title": "The Engine Behind Wealth Building",
      "content": "Compound interest is exponential math disguised as patience. Each period, your balance earns interest not just on your principal but on the interest already accumulated. This snowball effect is why consistent savers often surpass higher earners who start late. The formula A = P(1 + r/n)^{nt} looks intimidating, but at its core it says: the earlier and more often you contribute, the more future you build."
    },
    {
      "type": "keypoints",
      "title": "Compounding Variables",
      "points": [
        {
          "title": "Principal (P)",
          "description": "Your starting amount. Larger principals kick-start growth, but even $50 can evolve into thousands given enough time."
        },
        {
          "title": "Rate (r)",
          "description": "Expressed as APY. Higher rates accelerate growth, yet even modest rates dramatically outperform zero."
        },
        {
          "title": "Frequency (n)",
          "description": "How often interest is applied—monthly, daily, continuously. More frequent compounding adds incremental boosts."
        },
        {
          "title": "Time (t)",
          "description": "The multiplier that converts patience into power. Doubling time often doubles results even without changing contributions."
        }
      ]
    },
    {
      "type": "content",
      "title": "Visualizing the Growth Curve",
      "content": "Imagine two savers: Maya and Jordan. Maya invests $200 a month from age 22 to 32 then stops. Jordan starts at 32, contributing $200 a month until 62. Assuming 7% annual growth compounded monthly, Maya still finishes with more money at 62 despite contributing for only 10 years. The curve proves that time in the market beats timing the market."
    },
    {
      "type": "highlight",
      "title": "Time Advantage",
      "content": "Start now. Waiting five years can cut your future balance nearly in half for long-term goals because you lose the most valuable compounding years.",
      "color": "green"
    },
    {
      "type": "content",
      "title": "Advanced Strategies for Savers",
      "content": "1. **Incremental Raises**: Boost contributions by 1-2% every time your salary increases.\n2. **Windfall Capture**: Route 50% of bonuses and tax refunds directly into compounding accounts.\n3. **Avoid Leakage**: Early withdrawals penalize you twice—once via fees/taxes and again by resetting compounding momentum.\n4. **Diversify Compounding**: Use HYSA for short-term goals, index funds for long-term growth, and tax-advantaged accounts like Roth IRAs to compound tax-free."
    },
    {
      "type": "keypoints",
      "title": "Compounding Frequency in Practice",
      "points": [
        {
          "title": "Daily vs Monthly",
          "description": "Daily compounding on 4% APY earns slightly more than monthly, but automation and contribution consistency matter more than chasing marginal differences."
        },
        {
          "title": "Dividend Reinvestment",
          "description": "In taxable brokerage or retirement accounts, automatically reinvest dividends so they immediately start earning more dividends."
        },
        {
          "title": "Tax Drag",
          "description": "Interest taxed annually slows compounding. Shelter long-term savings in tax-advantaged accounts whenever possible."
        }
      ]
    },
    {
      "type": "content",
      "title": "Scenario Builder",
      "content": "Use this quick formula to estimate growth: Future Value = Contribution × [((1 + r/n)^{nt} - 1) / (r/n)]. Plug in real numbers for your situation. For example, $300 monthly at 5% APY compounded monthly for 8 years → $35,575. Adjust rate and time to stress-test conservative and optimistic scenarios."
    },
    {
      "type": "actionsteps",
      "title": "Compound Interest Playbook",
      "steps": [
        "Calculate your current emergency fund growth using the compound interest formula and a realistic APY",
        "Open or review a tax-advantaged account (Roth IRA, 401(k)) and verify dividends are set to reinvest",
        "Set a calendar reminder tied to pay raises to increase contributions by at least 1%",
        "Model two scenarios—starting now vs. starting five years later—and note the difference in ending balance",
        "Choose one account today and automate an incremental contribution increase"
      ]
    },
    {
      "type": "protip",
      "title": "Stack the Future",
      "content": "Pair compounding with visual trackers. Watching your exponential curve climb a chart turns an abstract concept into daily motivation.",
      "icon": "lightbulb"
    }
  ]
}
