{
  "title": "Saving for Major Goals",
  "type": "exercise",
  "duration": "30 min",
  "points": 185,
  "sections": [
    {
      "type": "hero",
      "title": "Plan and Fund Big Goals",
      "subtitle": "Engineer multi-year savings wins for travel, down payments, education, and life milestones"
    },
    {
      "type": "overview",
      "title": "What You'll Do",
      "items": [
        "Inventory every major goal and translate dreams into dollar amounts",
        "Reverse-engineer realistic timelines with buffers for inflation and surprises",
        "Design multi-layer contribution schedules that flex with your income",
        "Build a visual dashboard that keeps motivation high and course-corrects quickly"
      ]
    },
    {
      "type": "content",
      "title": "Clarity Before Contribution",
      "content": "Vague goals drain motivation. The difference between \"I want a house someday\" and \"I need $40,000 for a down payment in 28 months\" is structure. This exercise forces specificity—exact cost, deadline, and emotional why. Once you can see the finish line, crafting a contribution plan becomes math instead of wishful thinking."
    },
    {
      "type": "keypoints",
      "title": "Cost Modeling Essentials",
      "points": [
        {
          "title": "Total Cost Baseline",
          "description": "Research real numbers: tuition quotes, airfare estimates, vendor proposals. Add 10-15% buffer to absorb inflation and unexpected fees."
        },
        {
          "title": "Milestone Slices",
          "description": "Break big totals into quarterly milestones. Mini-deadlines keep urgency high and let you celebrate partial wins."
        },
        {
          "title": "Funding Mix",
          "description": "Decide what portion comes from savings, employer benefits, side income, or gifts so you are not relying on one source."
        },
        {
          "title": "Liquidity Match",
          "description": "Short timelines stay in HYSA or cash equivalents. Goals 2+ years out can use CDs, I Bonds, or conservative investment accounts."
        }
      ]
    },
    {
      "type": "content",
      "title": "Design the Contribution Engine",
      "content": "With costs nailed down, translate totals into monthly and bi-weekly contribution targets. Use percentages when income fluctuates: allocate 8% of every paycheck to the home fund, 3% to travel, etc. When bonuses or tax refunds arrive, route a predetermined slice (for example 60%) toward the highest-priority goal before lifestyle creep absorbs it."
    },
    {
      "type": "content",
      "title": "Stress-Test Your Plan",
      "content": "Run two stress scenarios: (1) income drops 10% for three months; (2) an emergency drains one month of contributions. Have a plan for both. Maybe you pause lower-priority goals or temporarily redirect discretionary spending. Building contingencies keeps you from abandoning the plan when life happens."
    },
    {
      "type": "actionsteps",
      "title": "Goal Funding Workshop",
      "steps": [
        "List three major goals with purpose statements and emotion behind them",
        "Research authentic costs and add a 12% buffer—record totals in a spreadsheet or the lesson worksheet",
        "Assign target dates and calculate months until each deadline",
        "Compute the base monthly contribution for each goal (total ÷ months)",
        "Decide which income sources feed each goal and map percentages",
        "Schedule automated transfers/sub-account rules that align with your pay cycle",
        "Create a one-page dashboard (Notion, Google Sheet, or app) that shows current balance, target, and months remaining"
      ]
    },
    {
      "type": "highlight",
      "title": "Proportion Rule",
      "content": "Fund every long-term goal at least a little each month, even if one goal is the priority. Momentum beats perfection—consistent $50 transfers keep the habit alive until you can scale up.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Tracking and Feedback Systems",
      "content": "Review progress at the end of every month. Log new contributions, note wins, and adjust percentages if you are ahead or behind schedule. Use visual cues like progress bars or thermometers. If you miss a month, add an extra 10% catch-up transfer the following month to stay aligned with the timeline."
    },
    {
      "type": "protip",
      "title": "Visibility Creates Buy-In",
      "content": "Share your dashboard with a partner or accountability buddy. When others can see progress, you subconsciously protect the streak and resist unnecessary withdrawals.",
      "icon": "lightbulb"
    }
  ]
}
