{
  "title": "Understanding Tax Brackets",
  "type": "reading",
  "duration": "18 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Decode Your Tax Bracket",
      "subtitle": "See how progressive tax rates work so you can plan earnings, deductions, and withholding with clarity"
    },
    {
      "type": "overview",
      "title": "What You'll Learn",
      "items": [
        "How marginal tax brackets are structured",
        "Why effective tax rate differs from marginal rate",
        "Strategies to keep taxable income in favorable ranges",
        "Tools to forecast changes before payday surprises"
      ]
    },
    {
      "type": "content",
      "title": "Progressive Taxation Basics",
      "content": "In the U.S. federal system, income is segmented into brackets. Each bracket is taxed at a marginal rate that applies only to the dollars within that bracket. You might be in the 24% bracket, but that rate applies to the last portion of your income—not the entire paycheck. Knowing this helps you estimate your true tax cost when taking on freelance work, bonuses, or raises." 
    },
    {
      "type": "keypoints",
      "title": "Key Concepts",
      "points": [
        {
          "title": "Marginal vs Effective",
          "description": "Marginal rate is the tax on the next dollar earned. Effective rate is total tax paid divided by total income—usually much lower." 
        },
        {
          "title": "Filing Status",
          "description": "Single, Married Filing Jointly, and Head of Household each have unique bracket thresholds that can materially change your bill." 
        },
        {
          "title": "Stackable Income",
          "description": "Ordinary wages, side-gig earnings, and short-term capital gains stack together, potentially pushing you into higher brackets." 
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Bracket Example",
      "content": "In 2025 a single filer owes 10% on the first $11,600, 12% on the next $35,450, and 22% on income between $47,050 and $100,525. Only income above $100,525 hits the 24% bracket.",
      "color": "blue"
    },
    {
      "type": "content",
      "title": "Why Planning Matters",
      "content": "Small adjustments—maxing a pre-tax 401(k), timing a Roth conversion, or shifting deductions—can keep taxable income from spilling into a higher bracket. Understanding thresholds also helps you forecast net pay from bonuses or stock vesting, so you're not caught off guard at tax time." 
    },
    {
      "type": "actionsteps",
      "title": "Map Your Bracket",
      "steps": [
        "Pull last year's return or your latest pay stub to determine current taxable income.",
        "Identify the marginal bracket you occupy based on filing status.",
        "List upcoming income events (bonus, freelance, RSUs) and estimate their tax impact.",
        "Note one lever—like increasing 401(k) contributions or funding an HSA—that could keep income in your desired bracket."
      ]
    },
    {
      "type": "protip",
      "title": "Use IRS Tools",
      "content": "Bookmark the IRS Tax Withholding Estimator to recalc your paystub withholding anytime life events shift your income.",
      "icon": "lightbulb"
    }
  ]
}
