{
  "title": "Tax Filing and Record Keeping",
  "type": "exercise",
  "duration": "25 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "File Confidently, Stay Audit-Ready",
      "subtitle": "Build a repeatable process for collecting documents, organizing receipts, and filing on time"
    },
    {
      "type": "overview",
      "title": "What You'll Build",
      "items": [
        "Annual document checklist tailored to your tax situation",
        "Digital filing system with clear folders and naming conventions",
        "Backup strategy that protects records for the required retention period",
        "Action plan for tracking deductions and credits throughout the year"
      ]
    },
    {
      "type": "content",
      "title": "Start With the Core Documents",
      "content": "Collect income statements (W-2s, 1099s), investment forms, and deduction support such as mortgage interest, property taxes, charitable receipts, and medical expense summaries. Scan paper documents immediately so you never rely on a single physical copy."
    },
    {
      "type": "keypoints",
      "title": "Organization System Essentials",
      "points": [
        {
          "title": "Folder Structure",
          "description": "Create top-level folders by tax year, then subfolders for income, deductions, credits, and correspondence."
        },
        {
          "title": "Naming Conventions",
          "description": "Use YYYY-MM-DD_documentname_vendor format so files sort chronologically and are easy to search."
        },
        {
          "title": "Retention Rules",
          "description": "Keep individual tax returns and supporting docs for at least three years—seven for business or property records."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Automate Safeguards",
      "content": "Sync your tax folders with encrypted cloud storage and enable two-factor authentication. Redundant backups protect you if a device fails.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Stay Up to Date",
      "content": "Subscribe to your tax professional's newsletter or IRS updates so you hear about new credits, deadlines, or document requirements early. Add reminders 30 days before tax deadlines to verify you have all forms."
    },
    {
      "type": "actionsteps",
      "title": "Create Your Filing Dashboard",
      "steps": [
        "List expected forms (W-2, 1099-K, 1098, brokerage statements, K-1, receipts) and mark when each arrives.",
        "Build digital folders using your naming convention and upload at least three documents today.",
        "Set retention reminders in your calendar for when documents can be archived or shredded.",
        "Document who prepares your taxes and how to securely share files with them.",
        "Schedule a post-filing review to note missing documents and improve next year's process."
      ]
    },
    {
      "type": "protip",
      "title": "Snap Receipts Immediately",
      "content": "Use a mobile scanner app to capture receipts the moment you receive them—tag by category so deductions are a breeze later on.",
      "icon": "camera"
    }
  ]
}
