{
  "title": "Deductions and Credits",
  "type": "exercise",
  "duration": "25 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Shrink Your Tax Bill the Smart Way",
      "subtitle": "Identify deductions and credits you actually qualify for and stack them into a compliant filing strategy"
    },
    {
      "type": "overview",
      "title": "What You'll Work Through",
      "items": [
        "Difference between above-the-line and itemized deductions",
        "Key tax credits for families, education, and clean energy",
        "How phase-outs, income limits, and carryforwards change the math",
        "Building a documentation checklist so you can substantiate each benefit"
      ]
    },
    {
      "type": "content",
      "title": "Deduction vs. Credit Deep Dive",
      "content": "Deductions reduce taxable income, while credits reduce the tax owed dollar-for-dollar. Above-the-line deductions like HSA contributions or student loan interest apply before adjusted gross income, potentially unlocking more credits. Itemized deductions add up mortgage interest, charitable gifts, and state/local taxes—evaluate whether they exceed the standard deduction before itemizing."
    },
    {
      "type": "keypoints",
      "title": "Popular Credits",
      "points": [
        {
          "title": "Child Tax Credit",
          "description": "Worth up to $2,000 per qualifying child, phasing out starting at $200,000 single/$400,000 married filing jointly."
        },
        {
          "title": "Lifetime Learning Credit",
          "description": "Covers 20% of up to $10,000 in qualified education expenses each year, per return, with income phase-outs."
        },
        {
          "title": "Clean Vehicle Credit",
          "description": "Worth up to $7,500 for eligible electric vehicles, but subject to MSRP caps, income limits, and final assembly rules."
        }
      ]
    },
    {
      "type": "highlight",
      "title": "Stack Withholding Wisely",
      "content": "Adjust Form W-4 or quarterly estimated payments after big deduction or credit changes so you keep cash flow aligned all year.",
      "color": "orange"
    },
    {
      "type": "content",
      "title": "Phase-Out Mechanics",
      "content": "Credits and deductions often shrink as income rises. Use tax software or IRS worksheets to find the exact reduction rate. When phase-outs loom, consider timing income, deferring bonuses, or increasing retirement contributions to stay under thresholds."
    },
    {
      "type": "actionsteps",
      "title": "Benefit Maximizer Workshop",
      "steps": [
        "List every deduction you used last year and categorize them as above-the-line or itemized.",
        "Estimate current-year eligibility for credits (child, education, energy) using IRS screening tools.",
        "Calculate whether bunching deductions (e.g., charitable giving) in one year beats the standard deduction.",
        "Create a digital folder structure for receipts, 1098/1099 forms, and credit certifications.",
        "Note any income phase-outs and design mitigation moves (retirement contributions, HSA funding, business expense timing)."
      ]
    },
    {
      "type": "protip",
      "title": "Document in Real Time",
      "content": "Use a scanning app to capture receipts the day you incur an expense. Tag them with categories so filing season becomes a drag-and-drop exercise.",
      "icon": "folder"
    }
  ]
}
