{
  "title": "Evaluating Dividend Stocks",
  "type": "reading",
  "duration": "28 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Evaluating Dividend Stocks",
      "subtitle": "Find quality dividend payers and avoid the traps",
      "color": "green",
      "icon": "Search"
    },
    {
      "type": "content",
      "title": "The Dividend Quality Checklist",
      "content": "Not all dividend stocks are created equal. A high yield means nothing if the company cuts the dividend next quarter. Use these criteria to separate quality dividend payers from risky ones."
    },
    {
      "type": "key-points",
      "title": "Essential Metrics to Analyze",
      "points": [
        {
          "title": "Dividend History (10+ Years)",
          "description": "Look for companies that have paid dividends consistently for at least 10 years, ideally with annual increases. Dividend Aristocrats (25+ years of increases) are the gold standard."
        },
        {
          "title": "Payout Ratio (Under 60%)",
          "description": "Dividends should be less than 60% of earnings for most companies. This leaves room for dividend growth and provides a cushion during tough times. REITs are an exception (they must pay 90%+)."
        },
        {
          "title": "Free Cash Flow Coverage",
          "description": "Dividends should be covered by free cash flow, not just earnings. A company can manipulate earnings but not cash. FCF payout ratio under 70% is healthy."
        },
        {
          "title": "Debt Levels (Debt/Equity Under 1.0)",
          "description": "High debt means interest payments compete with dividends. In a recession, debt payments come first. Look for debt-to-equity under 1.0 for most industries."
        },
        {
          "title": "Earnings Growth (Positive Trend)",
          "description": "Dividends come from earnings. If earnings are declining, dividends will eventually follow. Look for consistent earnings growth over 5-10 years."
        }
      ]
    },
    {
      "type": "content",
      "title": "Red Flags to Avoid",
      "content": "Yield Over 8%: Unless it's a REIT or MLP, yields this high usually signal trouble. The market is pricing in a dividend cut.\n\nPayout Ratio Over 100%: The company is paying more in dividends than it earns. This is unsustainable and a cut is likely.\n\nDeclining Revenue: If sales are shrinking, profits will follow, and dividends will be cut. Avoid companies in secular decline.\n\nRecent Dividend Cut: Once a company cuts its dividend, it often cuts again. The trust is broken. Wait for a multi-year recovery before investing.\n\nHigh Debt with Rising Rates: Companies with lots of debt suffer when interest rates rise. Their interest expenses increase, leaving less for dividends.\n\nOne-Time Special Dividends: A large special dividend often means the company has no better use for the cash—not a sign of a healthy, growing business."
    },
    {
      "type": "content",
      "title": "Where to Find Dividend Data",
      "content": "Free Resources:\n- Yahoo Finance: Basic dividend info, yield, payout ratio\n- Seeking Alpha: Dividend history, analysis articles\n- Dividend.com: Comprehensive dividend data and screeners\n- Simply Safe Dividends: Dividend safety scores (limited free access)\n\nBroker Tools:\n- Fidelity, Schwab, and Vanguard all have dividend screeners\n- Filter by yield, growth rate, payout ratio, and sector\n\nKey Data Points to Check:\n- Current yield and 5-year average yield\n- Dividend growth rate (1, 3, 5, 10 years)\n- Payout ratio (earnings and cash flow based)\n- Years of consecutive dividend increases\n- Ex-dividend dates and payment schedule"
    },
    {
      "type": "steps",
      "title": "How to Analyze a Dividend Stock",
      "steps": [
        "Check dividend history - has it paid and increased dividends for 10+ years?",
        "Calculate payout ratio - is it under 60% (or 80% for utilities/REITs)?",
        "Review free cash flow - does FCF cover the dividend with room to spare?",
        "Examine debt levels - is debt-to-equity reasonable for the industry?",
        "Analyze earnings trend - are profits growing or declining?",
        "Compare yield to history - is current yield unusually high (potential trouble)?",
        "Read recent news - any red flags like lawsuits, management changes, or guidance cuts?",
        "Check analyst ratings - what do professionals think about dividend safety?"
      ]
    },
    {
      "type": "callout",
      "title": "The Yield Trap",
      "content": "If a stock's yield is much higher than its historical average, ask why. Often it's because the stock price crashed due to problems the market sees. A 7% yield that becomes 3.5% after a dividend cut is worse than a stable 3% yield.",
      "color": "red",
      "icon": "AlertTriangle"
    },
    {
      "type": "content",
      "title": "Sample Analysis: Johnson & Johnson (JNJ)",
      "content": "Let's apply our criteria to a real dividend stock:\n\nDividend History: 60+ consecutive years of dividend increases (Dividend King)\nCurrent Yield: ~3.0%\nPayout Ratio: ~45% of earnings\nFree Cash Flow: Dividend well-covered by FCF\nDebt/Equity: ~0.4 (conservative)\nEarnings Trend: Steady growth over decades\n\nVerdict: High-quality dividend stock. Sustainable dividend with room for growth. The yield isn't exciting, but the safety and growth potential are excellent.\n\nThis is what a quality dividend stock looks like—boring, reliable, and likely to keep paying for decades."
    },
    {
      "type": "callout",
      "title": "Key Takeaway",
      "content": "Quality matters more than yield. A 3% yield from a Dividend Aristocrat that grows 8% annually is far better than a 7% yield that gets cut in half. Do your homework before buying any dividend stock.",
      "color": "green",
      "icon": "CheckCircle"
    },
    {
      "type": "content",
      "title": "Next Steps",
      "content": "You now know how to evaluate dividend stocks. In the next lesson, we'll explore building a diversified dividend portfolio—how many stocks to own, which sectors to include, and how to balance yield with growth."
    }
  ]
}
