{
  "title": "Dividend Investing Mistakes & Best Practices",
  "type": "reading",
  "duration": "22 min",
  "points": 100,
  "sections": [
    {
      "type": "hero",
      "title": "Dividend Investing Mistakes",
      "subtitle": "Learn from others' expensive lessons",
      "color": "green",
      "icon": "AlertTriangle"
    },
    {
      "type": "content",
      "title": "The Most Common Dividend Investing Mistakes",
      "content": "Even experienced investors make these mistakes. Learning to avoid them will save you money and heartache."
    },
    {
      "type": "key-points",
      "title": "Mistakes to Avoid",
      "points": [
        {
          "title": "Chasing Yield",
          "description": "Buying stocks solely because of high yields (8%+). High yields often signal trouble—the market expects a dividend cut. A 10% yield that gets cut to 5% destroys your income AND your principal."
        },
        {
          "title": "Ignoring Dividend Safety",
          "description": "Not checking payout ratios, debt levels, and earnings trends. A dividend is only as good as the company's ability to pay it. Always verify sustainability before buying."
        },
        {
          "title": "Over-Concentration",
          "description": "Putting too much in one stock or sector. If 30% of your income comes from one company and it cuts its dividend, you lose 30% of your income overnight. Diversify."
        },
        {
          "title": "Selling During Dips",
          "description": "Panic selling when stock prices drop. If the dividend is safe, price drops are buying opportunities, not selling signals. Focus on income, not price."
        },
        {
          "title": "Ignoring Dividend Growth",
          "description": "Focusing only on current yield and ignoring growth rate. A 2% yield growing 10% annually beats a 4% yield growing 2% annually within 10 years."
        }
      ]
    },
    {
      "type": "content",
      "title": "More Mistakes to Watch For",
      "content": "Not Reinvesting Dividends: Taking cash when you don't need it. Reinvesting dividends is the key to compounding. DRIP until you need the income.\n\nBuying Right Before Ex-Dividend Date: The stock price drops by approximately the dividend amount on the ex-date. You're not getting 'free money'—you're just getting your own money back, minus taxes.\n\nIgnoring Total Return: Dividends are part of total return, not a separate thing. A stock that pays 4% but drops 10% lost you 6%. Consider both income and capital appreciation.\n\nHolding Dividend Cutters: Loyalty to a stock that cut its dividend. Once a company cuts, it often cuts again. Sell and move on to better opportunities.\n\nNot Tracking Your Income: Not knowing how much dividend income you receive. Track it monthly to stay motivated and catch problems early."
    },
    {
      "type": "content",
      "title": "Best Practices for Dividend Investors",
      "content": "Focus on Quality: Buy companies with long dividend histories, sustainable payout ratios, and strong competitive positions. Dividend Aristocrats and Kings are good starting points.\n\nDiversify Properly: Own 20-30 stocks across 8-10 sectors. No single stock over 5% of portfolio. No sector over 20%.\n\nReinvest Until Retirement: Enable DRIP and let compounding work. The longer you reinvest, the more powerful the effect.\n\nThink Long-Term: Dividend investing rewards patience. Ignore short-term price movements and focus on growing income over decades.\n\nMonitor Your Holdings: Review each position quarterly. Check for dividend announcements, earnings reports, and any red flags. Sell if the thesis breaks.\n\nKeep Learning: The best dividend investors continuously educate themselves. Read annual reports, follow dividend-focused blogs, and learn from mistakes."
    },
    {
      "type": "steps",
      "title": "Your Dividend Investing Checklist",
      "steps": [
        "Before buying: Check dividend history (10+ years), payout ratio (<60%), and debt levels",
        "Diversify across 20-30 stocks in 8-10 sectors",
        "Enable DRIP for all positions",
        "Hold dividend stocks in appropriate accounts (REITs in IRA, qualified dividends in taxable)",
        "Review portfolio quarterly for red flags",
        "Track dividend income monthly",
        "Reinvest until you need income",
        "Stay patient—dividend investing is a marathon, not a sprint"
      ]
    },
    {
      "type": "callout",
      "title": "The Dividend Investor's Mindset",
      "content": "Think of yourself as a business owner collecting profits, not a trader chasing prices. Your goal is growing income, not timing the market. When prices drop, you're buying more income at a discount. This mindset shift is the key to dividend investing success.",
      "color": "blue",
      "icon": "Lightbulb"
    },
    {
      "type": "content",
      "title": "Putting It All Together",
      "content": "You've learned the complete dividend investing framework:\n\n1. Basics: What dividends are and why they matter\n2. Evaluation: How to identify quality dividend stocks\n3. Portfolio: How to build a diversified dividend portfolio\n4. Compounding: The power of dividend reinvestment\n5. Taxes: How to minimize your tax burden\n6. Mistakes: What to avoid and best practices\n\nNow it's time to take action. Start with dividend ETFs if you're new, or begin researching individual stocks using the criteria you've learned. The most important step is the first one—start investing and let time work its magic."
    },
    {
      "type": "callout",
      "title": "Congratulations!",
      "content": "You've completed the Dividend Investing module! You now have the knowledge to build a portfolio of quality dividend stocks that can provide growing income for decades. Take the quiz to test your knowledge and earn your completion badge.",
      "color": "green",
      "icon": "Award"
    }
  ]
}
