{
  "title": "Major Financial Decisions Together",
  "type": "reading",
  "duration": "28 min",
  "points": 150,
  "sections": [
    {
      "type": "hero",
      "title": "Major Financial Decisions",
      "subtitle": "Navigate big money choices as a united team",
      "color": "red",
      "icon": "Home"
    },
    {
      "type": "content",
      "title": "The Stakes Are Higher Together",
      "content": "Major financial decisions—buying a home, having children, changing careers, starting a business—have lasting impacts on your shared life. These aren't decisions to make impulsively or unilaterally. They require careful discussion, planning, and mutual agreement.\n\nThe good news? Making big decisions together strengthens your partnership. When you navigate complex choices as a team, you build trust, communication skills, and a shared sense of accomplishment."
    },
    {
      "type": "key-points",
      "title": "Major Decisions That Require Joint Planning",
      "points": [
        {
          "title": "Buying a Home",
          "description": "The biggest purchase most couples make. Consider location, budget, mortgage terms, and how it fits your lifestyle. Both partners should be comfortable with the financial commitment."
        },
        {
          "title": "Having Children",
          "description": "Children cost $250,000+ to raise to age 18. Discuss childcare, career impacts, education savings, and how your budget will change. Plan before pregnancy if possible."
        },
        {
          "title": "Career Changes",
          "description": "Job changes, going back to school, or starting a business affect household income and stability. Discuss timing, financial runway, and backup plans."
        },
        {
          "title": "Major Purchases",
          "description": "Cars, renovations, expensive vacations. Set a threshold (e.g., $1,000+) that requires joint discussion and agreement before purchasing."
        },
        {
          "title": "Supporting Family",
          "description": "Helping parents, siblings, or adult children financially. Discuss boundaries, amounts, and how it affects your own goals."
        }
      ]
    },
    {
      "type": "content",
      "title": "The Decision-Making Framework",
      "content": "For any major financial decision, work through these questions together:\n\n1. What problem are we solving or goal are we pursuing?\nBe clear about the 'why.' Buying a house for more space is different from buying for investment.\n\n2. What are all our options?\nDon't jump to the first solution. Brainstorm alternatives. Renting vs. buying. New car vs. used. Public school vs. private.\n\n3. What are the financial implications of each option?\nCalculate costs, including hidden ones. A house isn't just the mortgage—it's taxes, insurance, maintenance, and opportunity cost.\n\n4. What are the non-financial implications?\nHow does each option affect your time, stress, relationships, and lifestyle?\n\n5. What's our timeline?\nIs this urgent or can we wait? Waiting often provides more options and better deals.\n\n6. What's our backup plan?\nIf this decision doesn't work out, what do we do? Having a Plan B reduces anxiety."
    },
    {
      "type": "callout",
      "title": "The 10-10-10 Rule",
      "content": "Before any major decision, ask: How will we feel about this in 10 minutes? 10 months? 10 years? This helps balance short-term excitement with long-term consequences.",
      "color": "blue",
      "icon": "Clock"
    },
    {
      "type": "content",
      "title": "Buying a Home Together",
      "content": "Home buying is often the first major joint financial decision. Key considerations:\n\nAffordability: Keep housing costs under 28% of gross income. Just because you're approved for more doesn't mean you should spend it.\n\nDown Payment: 20% avoids PMI, but 10-15% is acceptable if you have strong finances otherwise. Don't drain your emergency fund for a down payment.\n\nLocation vs. Size: A smaller home in a great location often appreciates better than a large home in a mediocre area.\n\nFuture Plans: Will you have kids? Work from home? Need space for aging parents? Buy for your 5-year future, not just today.\n\nOwnership Structure: Married couples typically own jointly. Unmarried couples should consult a lawyer about ownership agreements and what happens if you split.\n\nEmergency Fund: Keep 3-6 months of expenses PLUS a home repair fund. Homes always have unexpected costs."
    },
    {
      "type": "content",
      "title": "Planning for Children",
      "content": "Children are a financial and lifestyle transformation. Plan ahead:\n\nBefore Pregnancy:\n- Build emergency fund to 6+ months\n- Review health insurance (maternity coverage, adding dependents)\n- Start a baby fund for initial expenses ($5,000-10,000)\n- Discuss parental leave options and income impact\n\nFirst Year Costs:\n- Childcare: $10,000-25,000/year depending on location\n- Diapers, formula, gear: $3,000-5,000\n- Medical costs: Varies by insurance\n\nOngoing Considerations:\n- 529 education savings (start early for compound growth)\n- Life insurance (both parents should have coverage)\n- Will and guardianship designations\n- Career impact (reduced hours, career breaks)\n\nThe Conversation: Discuss who will handle childcare, how careers will be affected, and how you'll maintain financial partnership when one parent may earn less or stay home."
    },
    {
      "type": "steps",
      "title": "Making a Major Decision Together",
      "steps": [
        "Identify the decision and agree it requires joint discussion.",
        "Set a timeline - when does this decision need to be made?",
        "Research independently - each partner gathers information.",
        "Share findings in a dedicated meeting (not casually over dinner).",
        "List pros and cons for each option together.",
        "Discuss concerns openly - what worries each of you?",
        "If you disagree, identify the underlying values or fears driving each position.",
        "Find a compromise or agree to revisit after more research.",
        "Once decided, commit fully - no 'I told you so' if it doesn't work out.",
        "Document the decision and reasoning for future reference."
      ]
    },
    {
      "type": "content",
      "title": "When Partners Disagree on Big Decisions",
      "content": "What if you can't agree? Some strategies:\n\nDelay if Possible: If there's no urgency, table the decision for 3-6 months. Circumstances or perspectives may change.\n\nSeek Outside Input: A financial advisor, trusted friend, or counselor can offer neutral perspective.\n\nTry a Pilot: Can you test the decision on a smaller scale? Rent in a neighborhood before buying. Try a side business before quitting your job.\n\nCompromise on Terms: If one partner wants to buy a house and the other doesn't, maybe agree to buy but with a smaller budget or longer timeline.\n\nTake Turns: For decisions that aren't critical, alternate who gets final say. 'You chose the last vacation destination, I'll choose this one.'\n\nAccept Impasse: Some decisions can wait indefinitely. If you can't agree on having children, that's a fundamental compatibility issue that may need professional help."
    },
    {
      "type": "callout",
      "title": "The Veto Rule",
      "content": "For truly major decisions (buying a house, having children, major career changes), both partners should have veto power. If one person is strongly opposed, don't proceed. A reluctant 'yes' often leads to resentment.",
      "color": "red",
      "icon": "AlertTriangle"
    },
    {
      "type": "content",
      "title": "Protecting Your Partnership",
      "content": "Major decisions can strain relationships. Protect your partnership by:\n\nMaintaining Perspective: A house is just a house. A job is just a job. Your relationship matters more than any financial decision.\n\nCelebrating Together: When you make a big decision and it works out, celebrate as a team. You did this together.\n\nLearning from Mistakes: If a decision doesn't work out, don't blame. Ask 'What can we learn?' and move forward.\n\nKeeping Communication Open: Check in regularly about how you're both feeling about major commitments. Buyer's remorse is normal—talk about it.\n\nRemembering Your 'Why': When the mortgage feels heavy or parenting is exhausting, remember why you made these choices together."
    },
    {
      "type": "callout",
      "title": "Key Takeaway",
      "content": "Major financial decisions are opportunities to strengthen your partnership. Approach them with patience, open communication, and mutual respect. The process of deciding together is as important as the decision itself.",
      "color": "green",
      "icon": "Heart"
    },
    {
      "type": "content",
      "title": "Congratulations!",
      "content": "You've completed the Couples and Money module! You now have tools for money conversations, account management, budgeting together, setting shared goals, handling disagreements, and making major decisions as a team. Take the quiz to test your knowledge and earn your completion badge. Remember: financial partnership is a journey, not a destination. Keep communicating, keep learning, and keep growing together."
    }
  ]
}
